[
  {
    "author": "Andrew Bellay",
    "author_desc": "Andrew Bellay is a strategic, process-oriented, technical, entrepreneurial, and client-facing jack-of-all-trades. He’s founded 3 companies and worked with hundreds more as a technology strategist, designer, developer, advisor, and investor. Currently, Andrew runs MetaNeer Labs – a software development firm located in the San Francisco Bay Area – and writes for Straty.com. His formal education includes a Bachelors of Science in Chemical Engineering, a Bachelors of Arts in Liberal Arts from UT Austin, and a Masters of Science in Management Science & Engineering from Stanford University.",
    "title": "A Developer's Guide To Strategy",
    "desc": "The word 'strategy' has become a poisoned word.\n\nIn this session, we'll answer the following questions:\n- What is Strategy? Why should you care?\n- What is Competition?\n- What is the source of Competition?\n- How can one analyze a given Strategy?\n- What makes for a good Strategy?\n- How can one construct a good Strategy?\n\nAfter 8 years of product and technology consulting, I've found that most start-ups and small businesses fail because they have a poor strategy. This session cuts through the hype and digs into what strategy is and isn't, leaving attendees with practical knowledge and processes that they can immediately apply to their careers, start-ups, and industries.\nDownload instructions to be prepared for this class\n\nDownload the speaker slides and material",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "Business",
      "Business Growth",
      "Competition",
      "Marketing",
      "Product Management",
      "startup",
      "Strategy"
    ]
  },
  {
    "author": "Claudia Galvan",
    "author_desc": "Claudia Galvan is a technical advisor to startups looking to expand internationally. Claudia is considered a world-wide expert in software internationalization. She has been responsible for building international teams from the ground-up and the technology used in platforms in Fortune 500 companies reaching billions of users around the world.",
    "title": "Advancing your Career through technical leadership skills",
    "desc": "Becoming a technical leader requires a sustained and intentional effort. In this talk, we will review some best practices to develop the skills needed to successfully lead technical projects. This talk is directed to people recently promoted to a technical leadership role or aspires to become a technical leader.",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "Career",
      "personal branding",
      "Product Management",
      "Project Management",
      "Team Management"
    ]
  },
  {
    "author": "Pritam Roy",
    "author_desc": "I am working as a Member of Consulting Staff at Mentor Graphics/CalyptoSystemsDivision. Prior to that, I was Consulting Engineer at Atrenta. I was a Post Doctoral Researcher at University of California, Los Angeles during Jan-Dec 2010. Before that, I have completed my Ph.D. studies under the supervision of Dr. Luca de Alfaro. I spent the summer of 2009 in SRI International. I had done the summer internship of 2007 in NEC Research Lab, USA. I spent the summer of 2005 in Foundations of Software Engineering (FSE) group at Microsoft Research Lab, Redmond, USA. I did B.Tech.(Hons) and M.S. from Computer Science and Engineering at Indian Institue of Technology, Kharagpur.",
    "title": "Android Device Drivers: Deep Dive into Android Kernel",
    "desc": "This is 2nd Talk in 3-talk track on Android Device Drivers.\n\nAndroid is a Linux-based architecture. In addition to the original Linux driver, Android need other additional device driver, like Android Logger, Binder, Low Memory killer, Power Management for android(wakelock), ASHMEM, etc out of which  ashmem ,logger and  binder are all character device drivers.\n\nHow about understanding one such driver and implementing our own driver ??",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "Android",
      "Linux",
      "Operating system"
    ]
  },
  {
    "author": "Zafar Shahid",
    "author_desc": "Dr. Zafar Shahid is an accomplished Multimedia Engineer with over 15 years of experience in real-time systems, multimedia stacks, applications and team- management. with ever increasing responsibilities in embedded, and desktop systems on Windows and Linux platforms. His experience spans big companies as Technicolor & Nvidia, and several start-ups. He has shipped several products successfully over the last decade. On the other hand, he has authored devised several algorithms which solved the problems on real-time protection for content storage and distribution. He has 3 books and over 40 internal publications and patents. He has extensively talked at international schools, conferences and technical workshops in morethan 10 countries.",
    "title": "Android Device Drivers: Getting Started",
    "desc": "This is first talk in a 3-talk track on Android Device Drivers.\n\nAndroid is a Linux-based architecture. In addition to the original Linux driver, Android need other additional device driver, like Android Logger, Binder, Low Memory killer, Power Management for android(wakelock), ASHMEM, etc out of which  ashmem ,logger and  binder are all character device drivers.\n\nHow about understanding one such driver and implementing our own driver ??",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "Android",
      "Linux",
      "Operating system"
    ]
  },
  {
    "author": "srinivas kocharlakota",
    "author_desc": "18 years of product development experience involving technologies that span multiple disciplines including embedded electronics,sensors, cloud computing serving as hands on engineering manager at LG Electronics .He leads\nIOT engineering group in LG electronics",
    "title": "Android Device Drivers: Implementing Android Binder.",
    "desc": "The is  #3 in 3-talk track on Android device drivers\n\nAndroid is a Linux-based architecture. In addition to the original Linux driver, Android need other additional device driver, like Android Logger, Binder, Low Memory killer, Power Management for android(wakelock), ASHMEM, etc out of which  ashmem ,logger and  binder are all character device drivers.\n\nHow about understanding one such driver and implementing our own driver ??",
    "date_time": "2:15 PM Sunday",
    "tags": [
      "Linux"
    ]
  },
  {
    "author": "Eugene Chuvyrov",
    "author_desc": "Eugene Chuvyrov is  a Senior Cloud Architect at Microsoft. He works directly with both startups and enterprises to enable their solutions in Microsoft cloud, and to make Azure better as a result of this work with partners. Over his tenure at Microsoft, his focus varied from modern DevOps, to enabling AI solutions in the cloud, to advising customers on creating Blockchain solutions in Azure. He is looking forward to sharing his knowledge from those engagements with the community.",
    "title": "Are we there yet? A pragmatic look at quantum computing and Q# with Azure",
    "desc": "Like superintelligence, practical quantum computing appears to be half a decade away... every half decade. In this session, we'll take a look at the basic principles behind quantum computing, the whys behind its potential, as well as the history of breakthroughs and developments in that space. We'll make a lengthy detour into programming quantum computer emulators with Visual Studio, Q# and Azure. We'll finish up by looking at the most promising pathways for making quantum computing practical and review whether it can indeed render all current encryption schemes obsolete and become the quickest path towards superintelligence.",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "Azure",
      "Quantum"
    ]
  },
  {
    "author": "Marcus Blankenship",
    "author_desc": "I have hired, lead and coached cross-disciplinary design & development teams for over 15 years. Today I help other agency owners and technicians elevate from doing the hands on work to leading their teams.",
    "title": "Ask the Expert: Q&A with Engineering Managers",
    "desc": "How do I handle an unreasonable boss? What if I don't trust my team to deliver good code?  How can I improve your team's attitude about agile?  Why do I have so many bugs???\n\nIn this unscripted format, speakers from the Management and Agile tracks answer audience questions.  Bring your toughest questions about agile, management, leadership, careers, terrible bosses and the pains of moving from Programmer to Manager.  \n\nFeeling shy?  Email your question advance to marcus@marcusblankenship.com and we'll answer it during the session.",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "management"
    ]
  },
  {
    "author": "Siamak Ashrafi",
    "author_desc": "(Ash) is Bio-Computational researcher@day working on bio-markers (publications*) & CTO@night of technology companies (patents*). His frequent code-a-thon wins have gone on to become published Apps (iOS & Android*). As a thought leader in wearable/mobile development he is an enthusiastic teacher / speaker  helping to promote the ecosystem (fashion* & technology*). But what he would really like is to get a major sponsor in all three phases of water. (Snowboarding* [solid], Surfing* [liquid] & Kiteboarding* [vapor])",
    "title": "Augmented Reality for the masses",
    "desc": "Now that both Android and iOS have augmented reality (AR) frameworks shipping with their IDE we will see an explosion of AR technology.  This session will provide an overview of building on ARKit (iOS) and ARCore (Android).\nWe start with what is AR and why it is considered the next big thing in tech by exploring the history and some mind bending demos.  \nAfter building a solid understanding of the what and why, we start diving into the how.  \nWe will explore how to build an AR app on three different platforms:\nNative iOS using XCode with Swift\nNative Android using Android Studio with Kotlin\nNative iOS & Android using game engines Unity and Unreal\nWe will outline the advantages and disadvantages of each to help differentiate the different development processes.\nThe hope is that after attending this talk the audience would be excited about the technology and have the appropriate knowledge to start down the path of AR development.\n\nDownload the speaker slides and material",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "Android",
      "AR",
      "iOS",
      "Mobile",
      "Unity"
    ]
  },
  {
    "author": "Adwait Ullal",
    "author_desc": "Adwait Ullal is an Azure Architect who has helped migrate applications, data centers to the cloud. His current focus is cloud computing, especially Azure. His past experience includes enterprise and solutions architecture.",
    "title": "Azure in the Enterprise - Governance & Organization",
    "desc": "Before you unleash Azure on your developers, etc., you may want to do some housekeeping or lay down some ground rules so that there is some method to the madness.\n\nThis session will provide you tips and tricks to organize your Azure subscriptions, control costs and perform other baseline activities.",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "Azure",
      "Best Practices",
      "Governance"
    ]
  },
  {
    "author": "Robin Shahan",
    "author_desc": "Robin has over 25 years of experience developing complex, business-critical applications for Fortune 100 companies. As President of Nightbird Consulting, she provided training and helped companies architect and develop scalable, efficient solutions utilizing the Azure platform. She is a 6-time Microsoft MVP, and now works for Microsoft as a Sr. Content Developer for Azure.\n\nRobin regularly speaks about Azure at various .NET User Groups and Code Camps and runs the San Francisco/Silicon Valley Azure meetup. She can be found on Twitter as @RobinDotNet, and you can read her articles about Azure (and other subjects) at http://robindotnet.wordpress.com.",
    "title": "Azure IoT Hub in action for developers",
    "desc": "In this talk, I'll explain what IoT Hub is and how it works with your IoT Solutions. I'll show programmatically how to create a simulated device for testing, and then write a sample for sending messages to the IoT Hub and routing those messages to different places based on message properties, such as Azure Storage, a Service Bus queue, and Power BI. Then I'll show some demos with an IoT Device (the MX Chip IoT DevKit) sending messages to an IoT hub.",
    "date_time": "3:45 PM Saturday",
    "tags": [
      ".NET",
      "Azure",
      "Cloud"
    ]
  },
  {
    "author": "Ami Levin",
    "author_desc": "Senior data tier architect, data modeler, database designer and SQL developer. Inventor of intelligent, autonomous performance optimization products. Designed, reviewed and optimized some of the world’s largest, most challenging, mission critical data environments. A seasoned speaker, instructor and mentor. Author of white papers and technical articles.",
    "title": "Big Data - the Biggest Fad of the Decade",
    "desc": "In this session we will investigate what Big Data really means, and more importantly - what it doesn't mean.\nWhat makes Big Data different than any other data? \nWhat makes Big Data challenges different than the same old challenges we had 30 years ago?\nTogether, we will perform an honest, inquisitive, and enlightening investigation of what Big Data really is, it's origins, and how it evolved over the last decade. We will use history, analytics and logic to dissect the beast, and expose it for what it really is. \nWhy should you care? \nThe Big Data hype is holding you back from doing what is really important with data - getting value out of it. Making sense of it.\nVendors, organizations, and architects have become so obsessed with the 'Big Data' fad, and too many either lost sight, or no longer have the resources to pursue their real goals.\nIn this session I will plea to your reasoning, critical thinking, and plain common sense, to wake up and shout with me \"The Emperor has no cloths!!!\"\n\"This is Mass Madness, You Maniacs\", Howard Beale (Network, 1976). https://www.youtube.com/watch?v=TPNBm4xv000",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "Big Data",
      "data",
      "Data analytics",
      "Data Architecture",
      "Data Science",
      "Data Services",
      "Database"
    ]
  },
  {
    "author": "MAULIN VASAVADA",
    "author_desc": "Maulin Vasavada is a software developer and an architect on the Kafka team at PayPal, building a suite of components for Kafka as a service. He has strong experience building large-scale financial systems, shipping and logistics software, and software release management systems. Previously, he worked for eBay and as a consultant for Sun Microsystems.",
    "title": "400 Billion Messages a Day with Kafka at Paypal",
    "desc": "PayPal is one of the biggest Kafka users in the industry; it manages and maintains over 40 production Kafka clusters in three geodistributed data centers and supports 400 billion Kafka messages a day. We will explore the management and monitoring PayPal applies to Kafka, from client-perceived statistics to configuration management, failover, and data loss auditing.",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "Kafka"
    ]
  },
  {
    "author": "Sungyeol Choi",
    "author_desc": "Sung is a Software Engineer at Smashwords. He has over ten years of experience in the software development. His experience spans from embedded system to the Web application development.  His current interest is web technologies including JavaScript, Ruby on Rails, React, Angular.",
    "title": "Brief history of JavaScript Modules",
    "desc": "Are you new to JavaScript and confused about module, module loader and module bundler? Or you have been writing JavaScript code for a while, but can’t get a grip of the jargons about module? You heard about the jargons like CommonJS, AMD, Browserify, SystemJS, Webpack, JSPM, etc., but don’t understand why we need them? I will try to explain what are they, and what problem they try to solve, and how they solve the problem.\nDownload the speaker slides and material",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "Coding",
      "ES6",
      "JavaScript"
    ]
  },
  {
    "author": "David Spark",
    "author_desc": "David Spark is a veteran tech journalist, owner of the B2B tech content marketing firm Spark Media Solutions, and author of “Three Feet from Seven Figures: One-on-One Engagement Techniques to Get More Leads at Trade Shows.” Spark blogs at SparkMinute.com and on Forbes. For weekly tech and media news, subscribe to his weekly podcast, Tear Down Show, and for content marketing tips, subscribe to the Spark Media Solutions YouTube channel.",
    "title": "CISO/Security Vendor Relationship Podcast - LIVE Recording!",
    "desc": "The popular new podcast comes to SVCC for a live recording. Fans of the show and those who've never heard it before are welcome to join David Spark, founder of Spark Media Solutions and his co-host Mike Johnson, CISO of Lyft as they welcome their guests Ahsan Mir, CISO of Autodesk and Geoff Belknap, CISO of Slack, to this mega-sized in-person episode.\n\nThis podcast is all about what has become a tenuous yet sorely needed relationship between buyers and sellers of security products. We run through quick tips, play games, CISO challenges, and vendor pitches our CISOs critique.",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "Security"
    ]
  },
  {
    "author": "Craig Berntson",
    "author_desc": "Craig has a passion for community and helping other developers improve their skills. He writes the column \"Software Gardening\" in DotNet Curry Magazine and is the co-author of \"Continuous Integration in .NET\" available from Manning. He works as a Senior Software Engineer at HealthEquity.",
    "title": "Clean Architecture",
    "desc": "We've heard about clean code for years, but what about clean architecture. In this session you will learn how to improve developer productivity by using clean architecture concepts. Topics to be discussed:- Understand function, components, and data separation- Determine what's important and what isn't- Defining boundaries and layers- Organizing components and services- And more",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "Architecture",
      "Modular Architecture",
      "Productivity"
    ]
  },
  {
    "author": "Jon Kalb",
    "author_desc": "Jon has been programming in C++ for two and a half decades.\n\nDuring the last twenty-five years he has written C++ for Amazon, Apple, Dow Chemical, Intuit, Lotus, Microsoft, Netscape, Sun, Yahoo! and a number of companies that you've not heard of.\n\nJon's current interest is developing his onsite training business. He has extensive experience with formal training and presentations on C++. Jon is an Approved Outside Training Vendor for Scott Meyers' training materials. For information on course content, dates, and rates, please contact \"jon\" at cpp.training. \n\nJon has done formal training or presentations on C++ at ACCU-Silicon Valley, Altara, Apple, Amazon, Bloomberg, BMW, C++Now, CppCon, HTRI, Microsoft, New York C++ Developers' Group, Portland C++ Users Group, San Francisco C++ User Group, Silicon Valley Code Camp, and Societe Generale.\n\nHe taught C++ at the Golden Gate University graduate school for five semesters.\n\nJon's talk on Exception-Safe Coding won Best Tutorial at C++Now.\n\nJon has been given the Microsoft MVP award for Visual C++ for 2014 and 2015.\n\nJon is chair of CppCon, C++Now and the C++ Track for Silicon Valley Code Camp.\n\nHe serves on the Advisory Board for Undo Software and chairs the Boost Steering Committee.",
    "title": "Common C++ Optimizations",
    "desc": "The C++ standard gives compilers room to optimize the code we write and in this session, we’ll explore how we can write code that exploits this power.\n\nOur goal is to write code that is as clear as possible without every compromising on performance and to unlock the best performance that the compiler can give us.\n\nWe’ll explore the inline keyword and its implications as well as copy elision and the return value optimization.",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "C/C++",
      "C++",
      "C++11",
      "Coding",
      "Compiling",
      "Performance",
      "templates"
    ]
  },
  {
    "author": "Suyash Joshi",
    "author_desc": "Suyash Joshi is a Developer Advocate at Oracle for Cloud, Mobile, AI and ChatBots and. Prior to his current job, he was a software engineer for 6 years developing and designing modern enterprise grade mobile applications. He is also a performing magician and passionate about STEAM education.\nHe also enjoys organizing events and speaking on various at meetups/conferences and participating at hackthons on the weekends.",
    "title": "Conversational Interface for Alexa and Magical Chatbots Facebook Messenger",
    "desc": "This session covers the design and coding process of bot design a critical first step that is often skipped and leads to poor UX and frustration. In the first half of the presentation you will learn best practices for designing a conversational experience that is not only useful but also delightful. You will understand about the types of bots—such as transactional, social and personal assistants—and how to create a compelling persona for your bot. \n\nThe second half is code focussed teaching you how to develop , deploy and test simple chatbot onto onto messaging platforms such as Facebook messenger. \n\nThis session will leave you with best practices for designing and developing conversational user interfaces and chatbots under your belt.",
    "date_time": "2:15 PM Sunday",
    "tags": [
      "AI",
      "bot",
      "bots",
      "Design",
      "Design Patterns"
    ]
  },
  {
    "author": "Gayle Laakmann McDowell",
    "author_desc": "Gayle Laakmann McDowell is the founder and CEO of CareerCup.com and the author of three books:\n\nCracking the Coding Interview (Amazon.com's #1 best-selling interview book) \nCracking the PM Interview (product manager) \nCracking the Tech Career \n\nShe is an interview consultant, helping companies improve their interview process and coaching startups through acquisitions/acqui-hires. She is also an interview prep instructor, hired by Facebook to teach an interview prep class for external software developer candidates.\nGayle has worked as a Software Engineer for Google, Microsoft and Apple. She holds a BSE and MSE from UPenn in Computer Science, and an MBA from the Wharton School.",
    "title": "Cracking the Coding Interview",
    "desc": "Programming interviews are a different breed from other interviews and, as such, require specialized skills and techniques. This talk will teach you how to prepare for coding interviews, what top companies like Google, Amazon, Facebook, and Microsoft really look for, and how to tackle the toughest programming and algorithm problems. This is not a fluffy be-your-best talk; it is deeply technical and will discuss specific algorithm and data structure topics.\nDownload the speaker slides and material",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "Algorithms",
      "Career",
      "Data Structures",
      "Hiring",
      "interviewing"
    ]
  },
  {
    "author": "Gayle Laakmann McDowell",
    "author_desc": "Gayle Laakmann McDowell is the founder and CEO of CareerCup.com and the author of three books:\n\nCracking the Coding Interview (Amazon.com's #1 best-selling interview book) \nCracking the PM Interview (product manager) \nCracking the Tech Career \n\nShe is an interview consultant, helping companies improve their interview process and coaching startups through acquisitions/acqui-hires. She is also an interview prep instructor, hired by Facebook to teach an interview prep class for external software developer candidates.\nGayle has worked as a Software Engineer for Google, Microsoft and Apple. She holds a BSE and MSE from UPenn in Computer Science, and an MBA from the Wharton School.",
    "title": "Cracking the Product Manager Interview",
    "desc": "Product managers are sometimes called the \"CEO of a product.\" But what is a product manager really and how you do you land this role? This talk will discuss what a product manager is, how the role differs across companies, what sort of experience an aspiring PM should cover, and what the PM interview is like and how to master it. This will not be your fluffy be-your-best talk; it will tackle the specific types of interview questions and how to handle them.\nDownload the speaker slides and material",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "APM",
      "Career",
      "Hiring",
      "interviewing",
      "Product Management"
    ]
  },
  {
    "author": "Troy Miles",
    "author_desc": "Troy Miles, aka the Rockncoder, is an award winning software developer, speaker, and author with over 37 years of professional experience. He is the author of the book, jQuery Essentials, numerous magazine articles and blog posts.\n\nHe began his career writing games in 6502 and x86 assembly for early computers like the Commodore 64, Apple II, and IBM PC. Along the way, he has twice won the game of the year award, fantastic reviews, and numerous accolades.\n\nNowadays he writes web & mobile apps for a Southern California-based automotive valuation and information company. He has hung up is assembly language hat, but is fluent in JavaScript, C#, C++, Java, Kotlin, and Clojure.\n\nNights and weekends he can usually be found writing cool apps for mobile and the web or teaching other developers how to do so. Troy has spoken at Velocity, MobileWeb Dev Con, Mobile Dev+Test, and NG-Vegas. He is also a regular speaker at the SoCal and Silicon Valley Code Camps plus in front of local developer groups all over Southern California. Many of his talks are on his YouTube channel.",
    "title": "C++ Web Servers and APIs",
    "desc": "The Internet is a voracious user of processing power. Delivering web pages, querying databases, and processing images are just a few of the tasks web servers and APIs handle. This need for raw CPU performance has led to a resurgence of C++. While C++ had never gone away, more than ever before, it is the go-to language when performance is paramount.\n\nMost developers are surprised to learn that web servers and APIs can be built using C++. They are even more surprised to find out there are free and open source libraries to help you implement all of the features of modern web applications.\n\nIn this session, we will build a small web server using C++ which can serve web pages and APIs.\nDownload the speaker slides and material",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "API",
      "C++",
      "C++11"
    ]
  },
  {
    "author": "Luba Gloukhova",
    "author_desc": "Luba Gloukhova facilitates and accelerates advanced research projects at a major R&D hub of the Silicon Valley. She supports Stanford GSB faculty by conceiving and generating innovative solutions that drive their cutting edge research.  Luba also serves as the founding chair of Deep Learning World, the premier conference covering the commercial deployment of deep learning.  \n\nLuba received her master's in analytics from the University of San Francisco and her bachelors in both applied math and economics from Berkeley. Before her current position in academic research, she gained industry experience in analytics consulting, high frequency trading analysis, catastrophe risk modeling, and quantitative marketing. Luba also teaches yoga and enjoys an active lifestyle.",
    "title": "Deep Learning: Capabilities Realized and New Frontiers",
    "desc": "Groundbreaking theory, big data, and compute power — with this trifecta, the extraordinary advent of deep learning seems almost inevitable. It propels machine learning to new heights across many industries. As we ride this wave of progress, still in acceleration, we come to a new class of challenges akin to those of traditional machine learning — but now the stakes are higher. In this presentation Luba Gloukhova will cover great challenges deep learning has already overcome and those that still remain.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "AI",
      "Analytics",
      "BigData",
      "Data Science",
      "Deep Learning"
    ]
  },
  {
    "author": "Sidharth Sharma",
    "author_desc": "Sid Sharma is leading the developer evangelism efforts at Agora.io. He has experience in both API and platform evangelism with heavy exposure in the CPaaS and real-time communications space. Sid started out as the first full time Developer Advocate at Nexmo and helped define the program while improving the developer experience which helped increase the API call rate by over 250% in 1.5 years. Afterwards, he joined CodinGame where he helped increase and engage their developer audience which grew by 3.5X during his time there to over 900k developers. Now at Agora.io, he has defined the developer relations program and has helped increase the number of active developers on the platform by 3X in just 7 months. Sid enjoys attending a variety of conferences covering a wide array of technologies, local meet-ups, and creating tutorials built off demos along with a variety of other activities within the developer community.",
    "title": "Developer Relations 101: What It Is And Why You Need It",
    "desc": "The Cloud Services world has shifted the entire economy. Developers are some of the most important and sought out roles in the job market. As devs are some of the smartest people on this planet, traditional marketing tactics are not nearly as effective on them. Instead, objective technical marketing, known as Developer Relations, is the way to go about.",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "Developer Relations",
      "Ethics",
      "management"
    ]
  },
  {
    "author": "Josue Bustos",
    "author_desc": "Josue is the lead technical evangelist at Samsung Electronics America, focusing his efforts to build and strengthen the designer and developer ecosystem in the United States and Canada. \n\nBefore moving to the Bay area from Los Angeles, he was a developer champion at Samsung Strategy and Innovation Center, to cultivate and bolster the ARTIK IoT platform within the maker community.  In LA, Josue produced large-scale unconferences for the tech and entrepreneur communities, painted murals overseas, and worked as an independent, full-stack, mobile-hybrid / iOS-native developer.\n\nWhen not traveling coast to coast, Josue loves to make art, ride his single speed bike to nearby restaurants and explore new bay area hiking trails.",
    "title": "Develop Galaxy Apps for Samsung Wearables",
    "desc": "Using your existing web technology skills, learn how to use Tizen Studio to develop a wearable web app and install it on the new Samsung Galaxy Watch.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "Wearable",
      "Web"
    ]
  },
  {
    "author": "Chris Richardson",
    "author_desc": "Chris Richardson is a developer and architect. He is a Java Champion, a JavaOne rock star and the author of POJOs in Action, which describes how to build enterprise Java applications with frameworks such as Spring and Hibernate. Chris was also the founder of the original CloudFoundry.com, an early Java PaaS for Amazon EC2. \n\nToday, he is a recognized thought leader in microservices and speaks regularly at international conferences. Chris is the creator of Microservices.io, a pattern language for microservices, and is writing the book Microservice Patterns, which is available as a Manning MEAP. He provides microservices consulting and training to organizations that are adopting the microservice architecture and is working on his third startup Eventuate, an application platform for developing transactional microservices.",
    "title": "Developing Asynchronous, Message-Driven Microservices",
    "desc": "The microservice architecture functionally decomposes an application into a set of services. Each service has its own private database that’s only accessible indirectly through the services API. Consequently, implementing queries and transactions that span multiple services is challenging. In this presentation, you will learn how to solve these distributed data management challenges using asynchronous messaging. I describe how to implement transactions using sagas, which are sequences of local transactions, coordinated using messages. You will learn how to implement queries using Command Query Responsibility Segregation (CQRS), which uses events to maintain replicas. I describe the key role that messaging plays a microservice architecture.",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "Architecture",
      "Asynchronous Programming",
      "events",
      "Messaging",
      "microservices"
    ]
  },
  {
    "author": "Steve Mylroie",
    "author_desc": "Steve is an independent software consultant in Silicon Valley specializing in the Microsoft product stack having retired after a 40+ year career doing semiconductor industry, with side excursions in to medical image management. Over the years he has worked with a wide range of platforms from mainframes to PCs, many of which have gone to the great scrap yard in the sky. \nCo-chair Baynet User Group's South Bay Chapter and Baynet Treasurer",
    "title": "Developing Microcontroller Appilcations with VSCODE",
    "desc": "Visual Studio Code (VSCODE) is primary thought of as a IDE for WEB and desktop application development; however with the proper extensions and external tool chains it can also provide a powerful IDE for microcontroller based applications. In this session the presenter will discuss the VSCODE extensions and tool chain configurations need to needed to turn VSCODE in to a microcontroller IDE. \n\nThe presentation will include two demonstrations of the use of VSCODE to develop microcontroller based IOT sensor applications\n1.\tA LoraWan rain gauge using C++ and the MBED libraries running on a Multi-Tech MDot\n2.\tA Bluetooth temperature sensor using Micro Python and the PyCom libraries running on a FiPi \n\nDownload the speaker slides and material",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "C++",
      "Debugging",
      "Development",
      "IoT",
      "Python",
      "Visual Studio Code"
    ]
  },
  {
    "author": "Manish Pandit",
    "author_desc": "Manish is Director of Engineering at Marqeta, a FinTech startup, where he is responsible for the Hybrid Cloud Architecture and delivery for the Payments Platform.\n\nPrior to Marqeta, he has worked at Capital One, Netflix, IGN, E*Trade, and Accenture in various engineering leadership roles. He has spoken at various conferences and meetups in an around SF Bay Area, including JavaOne, OSCON, Silicon Valley Code Camp, and APICon SF.\n\nHe blogs at https://lobster1234.github.io",
    "title": "Disaster Recovery - What, Why, and How",
    "desc": "As companies move towards Microservices and Cloud-based deployments, multiple points of failure emerge in the infrastructure. With critical uptime demands and tight SLAs, high availability and reliability become just as important and visible. In this talk I'll cover the what, why, and how of Disaster Recovery. \n\nDisaster Recovery usually is an afterthought, but with good blueprints and practices, it should and can be a part of the SDLC, allowing us to build mission critical services that can survive disasters without degrading the quality of service. With the PasS offerings from public cloud platforms, DR has become a lot more cost effective and easy to implement. I will talk about key terms and metrics used for DR, and strategies which can be applicable to any type of infrastructure - on prem, on cloud, or hybrid.\n\nAfter this talk, you will become very familiar with Disaster Recovery fundamentals, and start thinking about options and strategies available based on your SLA while you architect your service. Terms like hot-cold, active-active will become much more relatable as well!\n\nI'll briefly refer to AWS and Data Center infrastructure during this talk - so basic familiarity with these will be helpful.",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "Architecture",
      "AWS",
      "Best Practices",
      "DevOps",
      "microservices"
    ]
  },
  {
    "author": "Aswani Nerella",
    "author_desc": "Aswani Nerella is a developer and architect at Blueshift (www.blueshift.com). Blueshift’s technology enables launching direct customer engagement at scale by combining behavioral data, AI and cross channel automation in an unified product. \n\nAswani is the co-inventor of PLaSMA (Personalization Language for Segment-­-of-­-One Marketing Automation), a language that enables combining real time context of a user with pre-­- computed product rankings based on their most recent behavior, CRM attributes or inferred affinities. Aswani has built Cassandra and REDIS backed microservices which serve huge amount of traffic at low latencies.\nPreviously, Aswani managed the Groupon Goods team and was instrumental in bringing up the 1st version of the node.js version of groupon.com/goods site.",
    "title": "Dissecting Dynamo: Highly available key value store",
    "desc": "Over the past decade, NoSQL DBs & key-value stores have played a major role in scaling of any web companies such as facebook, google or twitter.\nAmazon's Dynamo paper has played a crucial role in kick-starting the NoSQL movement and inspiring many key-value stores such as Cassandra.\nIn this session, I'd like to dig deeper into the fundamentals of designing such a highly available & high throughput key-value systems.\nI'd be going into great detail about data partitioning, replication, versioning and hinted handoffs.",
    "date_time": "3:30 PM Sunday",
    "tags": [
      "Database"
    ]
  },
  {
    "author": "Ryan Delucchi",
    "author_desc": "Ryan is a Principal Engineer for the Banno Group at Jack Henry & Associates, specializing in Pure Functional Programming in Scala.  He has worked extensively with Scalaz, scalaz-streams, fs2, cats and http4s and has previously worked at Verizon Labs.",
    "title": "Essentials for Reasonable Software Design",
    "desc": "After decades of being awash in complicated frameworks, navigating unwieldy code-bases with entangled concerns and convoluted implementation patterns: there is a natural desire to \"get back to the fundamentals\".  Of course, knowing exactly where to look for these \"fundamentals\" isn't necessarily obvious.  In fact, the very last place one might look, would be this seemingly fashionable paradigm: Functional Programming.",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "Design",
      "functional programming"
    ]
  },
  {
    "author": "Guinder Bhangoo",
    "author_desc": "Gurinder has been involved in the Crypto World since 2013. As an avid developer who always dabbled in new Tech, Gurinder has a large knowledge of Blockchain, Distributed Ledger Technology, Smart Contracts, & Crypto Trading. Before getting into Blockchain he was building Android & iOS Apps and now he has created 2 Mobile Apps that run on his own private Blockchain.\n\nDuring the day, Gurinder Develops & Deploys Blockchains and Smart Contracts, During nights and weekends, he either teaches or oversees the Blockchain Education at DEN (Decentralized Education Nexus). There's nothing better to him than seeing that shine in people's eyes when they interact with a Smart Contract for the first time!",
    "title": "Ethereum & Smart Contracts",
    "desc": "Bitcoin took the world by surprise in the year 2009 and popularized the idea of decentralized secure monetary transactions. The concepts behind it, however, can be extended to much more than just digital currencies. Ethereum attempts to do that, marrying the power of decentralized transactions with a Turing-complete contract system.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "Bitcoin",
      "blockchain",
      "Ethereum",
      "smart contracts"
    ]
  },
  {
    "author": "Brad Irby",
    "author_desc": "Brad is an accomplished .NET software architect specializing in Domain Driven Design and Event Driven Architectures.  Over his 30 year professional career, Brad has built web applications for Adidas, Kashi, Gap, Wells Fargo, Bank of America, Aptos, and many others.  Brads specialty is migrating existing .NET applications to a DDD architecture and EDA without system downtime.\n\nBrad has been the organizer of the San Francisco and Silicon Valley .NET user groups, and is frequent speaker on technical software topics throughout the US, South America, and Europe.\n\nBrad has written a book on Reengineering .NET published by Adison Wesley.",
    "title": "Event Driven Architecture – Enabling  Microservices",
    "desc": "Event Driven Architecture is a way of building small or large systems, that takes full advantage of Microservices and proper architectural design.  Using messages as the communication mechanism among different services allows more independence of the individual components that make up a larger system, thus enabling faster development, faster deployment, and additional scalability.  Introducing Persistent Messages further enhances the architecture to allow time independence as well.\n\nIn this talk we will look at the overall structure of an Event Driven Architecture, discuss the business and technical advantages, and review how to migrate an existing application to an Event Driven Architecture.  Brad will present his experiences in migrating an existing application to an Event Driven Architecture, talk about lessons learned along the way.\n\nIf you have a large legacy application you need to break into microservices, or you are involved in a Domain Driven Design project, this talk is for you.",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "Architecture",
      "CQRS",
      "Distributed Application",
      "events",
      "microservices"
    ]
  },
  {
    "author": "wesley chun",
    "author_desc": "+WESLEY CHUN, MSCS, is the author of Prentice Hall's bestselling \"Core Python\" book series & companion videos (corepython.com), co-author of \"Python Web Development with Django\" (withdjango.com), and has written for Linux Journal, CNET, and InformIT. In addition to being an engineer & Developer Advocate at Google, he runs CyberWeb (cyberwebconsulting.com), a consultancy specializing in Python training. Wesley has over 25 years of programming, teaching, and writing experience, including helping create Yahoo!Mail using Python almost 2 decades ago. He has taught numerous Python courses at Cisco, Disney, VMware, UC Santa Barbara, UC Santa Cruz, & Foothill College. Wesley holds degrees in CS, Math, and Music from the University of California, and loves traveling worldwide to meet developers, whether at a technical conference, user group meeting, or on a university campus. He is a Fellow of the Python Software Foundation and can be reached on Google+ or Twitter (@wescpy).",
    "title": "Exploring Google APIs with Python and JavaScript",
    "desc": "* BRING YOUR LAPTOPS FOR LIVE CODING! *Want to integrate Google technologies into the web+mobile apps that you build? Google has various open source libraries & developer tools that help you do exactly that. Users who have run into roadblocks like authentication or found our APIs confusing/challenging, are welcome to come and make these non-issues moving forward.The first half of the talk covers the Google APIs Client Library, specifically with Python, although you could use any of the other languages supported. We'll then describe the steps necessary to create projects & enable Google APIs from the Google Developers Console. Next we discuss how to create & access the needed credentials, then write code that talks to several Google APIs.While you can do the same thing using JavaScript, there is another developer tool that gives you access to Google APIs but in a slightly different way. The second half of the talk covers Google Apps Script, a self-contained JavaScript environment in the Google cloud. You'll learn what Apps Script is and how it's more like using \"services\" than traditional APIs. We'll show its dev environment and create a Google Sheets spreadsheet w/code that talks to several Google APIs.The applications you build, whether they use the Client Library or Apps Script, can be reached by any client, browser, desktop/laptop or mobile. Come join us & learn how to leverage the power of Google technologies in the next apps you build!\nDownload the speaker slides and material",
    "date_time": "2:15 PM Sunday",
    "tags": [
      "API",
      "Apps",
      "Cross Platform",
      "Google",
      "JavaScript",
      "OAuth",
      "Python"
    ]
  },
  {
    "author": "Miguel Torres",
    "author_desc": "Miguel Torres is principal architect and a full-stack developer at TIBCO Software, responsible for leading the TIBCO blockchain lab as well as collaborating on open source project TIBCO Flogo. Miguel came to TIBCO in 2007 as a software engineer as part of TIBCO ActiveMatrix® BPM team in England, then moved to California to be part of TIBCO Enterprise Administrator, TIBCO Cloud Integration platform and TIBCO Flogo as an architect and developer. Miguel holds a software engineering degree from Cranfield University in England.",
    "title": "Extending Blockchain to IoT",
    "desc": "Most people have heard of Bitcoin, and also know that blockchain is one of the underlying concepts behind this cryptocurrency.  However, the ability to share information via a shared, trusted distributed network with embedded business logic also has many potential benefits for an IoT deployment.  Join this session to hear about blockchain and associated concepts such as smart contracts, and what we, as technologists, should be thinking about as we look to apply these concepts across various IoT use cases.\n\nSession will involve a discussion of utilizing technologies related to blockchain (distributed ledgers, smart contracts, cryptography, consensus) as a mechanism for building a smart IoT network.  Associated technologies such as offchain analytics and graph storage will also be discussed as part of a broader blockchain-led IoT enterprise architecture.  Various sample use cases will be discussed, as well as items that must be considered for a successful blockchain enterprise implementation.",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "Architecture",
      "blockchain",
      "Internet of Things"
    ]
  },
  {
    "author": "Anastasia Radchenko",
    "author_desc": "Anastasia Radchenko is a backend developer on Confluence at Atlassian. She has a background in aerospace engineering, but prefers the freedom of design in software engineering. She is currently working on scaling Confluence for tenants larger than 2k users.",
    "title": "Extreme Tips for Extreme Confluence Users",
    "desc": "In this talk you will master how to make your pages stand out, how to make data more consumable in Confluence, and how to integrate best with JIRA. You will also learn the most useful keyboard shortcuts, how to make your pages more searchable, and other tips and tricks.What will be covered:- Page properties macro and other content aggregating macros- How confluence search finds pages- Page layouts and how to make aesthetic pages(We'll share a usable CSS template that can be included on pages)- Useful Confluence shortcuts like '{' to add macros, 'Command+k' to add links, table editing shortcuts etc- JIRA integration macro and JIRA issue creator- Powerful 3rd party macro tricks, like Deck of Cards macro, Advanced Tables + SQL macroTalk attendees will receive a laminated cheat sheet of confluence keyboard shortcuts.",
    "date_time": "2:15 PM Sunday",
    "tags": [
      "Confluence"
    ]
  },
  {
    "author": "Martin Omander",
    "author_desc": "Martin Omander works for Google in Mountain View, California. His job in the Developer Relations team is to help developers build better software, and improve Google's Cloud Platform to make it even better for that purpose. In his spare time he manages to sneak in some game programming. Before Google, Martin worked at string of startups in Silicon Valley as a software engineer.",
    "title": "Focus on Your Code, Not Your Infrastructure, with Google Cloud Functions",
    "desc": "When you build a backend to a web app or mobile app, you want to focus on your business logic, not on your infrastructure. At the same time, you want the infrastructure to always be there for you, ready to run your code. Google Cloud Functions does that for you.\n\nIn this talk, we will follow the story of the fictional startup \"In Jest\", publishers of an app that tells jokes. At first, the developers at \"In Jest\" need to get a minimum viable product up and running in an hour. As their business grows they will have to integrate with Google Sheets, SQL databases, analytics systems, marketing systems and so on. We will see the code used to make this happen, without having to worry the team about servers and data centers.\nDownload instructions to be prepared for this class",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "App Deployment",
      "Cloud Functions",
      "JavaScript",
      "Server Side JavaScript",
      "serverless"
    ]
  },
  {
    "author": "Andrew Karcher",
    "author_desc": "Andrew is a Data Professional that is super passionate about the ability of data to drive change in our world, work, and personal lives. He has over 15 years of experience across multiple roles, companies and technologies.  A passion for learning is core to how I approach life. Over 10+ years I have spoken at User Groups, Code Camps, SQL Saturdays and Conferences along with supporting my local community as a SQL Saturday Organizer, User Group leader, and advocate for community involvement for all technology professionals. I was also recognized by Microsoft as a four-time SQL Server MVP for my technical community contributions.",
    "title": "Foundations of a Data Driven Organization",
    "desc": "What is Data Driven? You might have heard someone at your organization say you need to be more data driven, but what does it mean? How does your organization need to change to be able to support being data driven?\n\nAs you might imagine it is a little bit more complicated that just saying the words or putting together a few charts. This session will talk about the fundamental things that you need to think about to move to being more data driven. It is a combination of people, process, policy and technology. This session will give you a lot to think about how to apply the principles of being data applies to your company.",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "Best Practices",
      "Big Data",
      "Data Architecture",
      "Data Services",
      "Database"
    ]
  },
  {
    "author": "Todd McLeod",
    "author_desc": "Champion of world class online instruction; teaching online since\n1997; honored as one of California’s top community college\ninstructors; studied online education at UC San Diego; started the\nOnline Teacher Training Program and taught college faculty in central\nCalifornia how to teach online; one of the world’s leading trainers in the Go programming language which is currently the\nhighest paying programming language in America; teacher to 528,918\nstudents last year online; founder of Greater Commons; motivating,\ninspiring, and teaching teachers how to teach online at their greatest\npotential - this is Todd McLeod, working every day for the greater\ncommon good.",
    "title": "Getting Started with The Go Programming Language ( golang )",
    "desc": "Go is an open source programming language that makes it easy to build simple, reliable, and efficient software. Go provides the ability for \"server-side\" programming. Traditional choices for server-side languages have included PHP, ASP, and JSP. Currently popular server-side programming languages include Ruby, Python, and Node.js. While there are advantages and disadvantages to all languages, no server-side language is going to be faster than \"Go.\" Couple the speed of Go with Google App Engine and Cloud Storage, and you are now using the exact same architecture as Google. This means that your web apps are going to be incredibly fast and will easily scale to millions of users. Go is an amazing choice for a server-side language as it was developed by some of the same individuals who created the C programming language and Unix, two of the most influential languages of all time. Robert Griesemer, Rob Pike, and Ken Thompson created Go to be a modern language that easily uses multiple cores, easily implements concurrency, easily works in distributed environments, and easily allows the programmer to write programs - it has a very lean and user-friendly syntax! Come learn about one of the greatest languages ever created. You will leave with resources and code samples to start making all of your software and apps really go.…\nDownload the speaker slides and material",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "App",
      "golang",
      "Web",
      "Web Performance",
      "Web services"
    ]
  },
  {
    "author": "Douglas Crockford",
    "author_desc": "Douglas Crockford discovered the JSON Data Interchange Format. He is also the author of _JavaScript: The Good Parts_. He has been called a guru, but he is actually more of a mahatma.",
    "title": "How JavaScript Works",
    "desc": "Douglas Crockford is the author of How JavaScript Works, the shocking best seller that rips the lid off behind the scenes. In this light-hearted romp thru the world's most misunderstood programming language, Crockford reveals what is actually going on, and how we can use this to write better programs. \n\n(First of two sessions)",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "JavaScript",
      "JSON"
    ]
  },
  {
    "author": "Paul Hacker",
    "author_desc": "Paul Hacker, a DevOps Architect with Microsoft, has over 15 years of application architecture, design, development, and management expertise in Microsoft technologies. Paul has a depth of experience in DevOps, ALM, Process Improvement, and Team Foundation Server and VSTS. Having distinguished himself as a leader in the IT industry he has been awarded the distinction of Microsoft MVP in the ALM category every year between 2006 - 2017. Paul is based in Zionsville Indiana, near Indianapolis.",
    "title": "How Microsoft Does DevOps",
    "desc": "Learn how the Visual Studio Team Services (VSTS) team at Microsoft has changed their approach to building software and services by adopting an Agile culture and mindset. Paul Hacker takes you on a journey of contrasting the “old way” with the “new way”, and shares key changes that contributed to the transformation including thoughts on teams, roles, sprints, planning, and learning.",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "Cloud",
      "DevOps"
    ]
  },
  {
    "author": "Russell Fustino",
    "author_desc": "Russ is a Developer Evangelist for Wowza and an Apress published book author, \"Azure and Xamarin Forms\". He’s a recipient of the INETA Lifetime Achievement and Microsoft MVP 2013-2018 awards and is a Xamarin Certified developer for building cross-platform apps (e.g., the Endorsed Jethro Tull App). Russ is a former Developer Evangelist for Microsoft, Russ’ ToolShed, Xamarin and Component One. Follow @RussFustino and @WowzaDev.",
    "title": "How to build video streaming iOS and Android apps",
    "desc": "Video streaming apps are all the rage and continue to demonstrate rapid growth in usage and creative implementations. Every vertical market has the need for video apps. So, you want to learn how to build a video streaming app, but you don’t know where to get started or you are not a video expert? Or maybe you are just curious about video technology? Then, this session is for you!To build a live-streaming app for iOS and Android, you don’t have to be a video expert. Using a mobile SDK and cloud streaming service can help you quickly and easily integrate live video into an existing app or service or build a livestream app from the ground up. Using these tools, you can build anything from a basic one-way broadcasting platform to a fully interactive live-streaming app that allows users to create and share their own videos. This is referred to as user generated content. It’s all about the tools, huh?Join Russ Fustino, Wowza Developer Evangelist, in this informative session and see how easy it is to get started building iOS and Android apps using video streaming with actual latency in the sub 3 second range. This just in… that is pretty darn fast for streaming to any point on the globe! Times are changing. Keep up with the times. Hope to see you at the session!What you will learn in this session:• How to video stream in iOS and Android apps.• Learn how to get the samples in the SDK and use them.• How to reduce latency of the stream.• Learn about video streaming basics.",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "Android",
      "iOS",
      "Mobile",
      "video",
      "Video Chat",
      "Xamarin",
      "Xcode"
    ]
  },
  {
    "author": "Marcus Stephan",
    "author_desc": "Highly experienced Software Developer and project manager with a successful track record in established small and large companies. Certified as ZCE (ZEND Certified Engineer). Specialized in web and mobile business, distributed systems and agile methods, with more than 20 years experience and proven expertise",
    "title": "How to Ruin Any Software Development Project",
    "desc": "If we study the numbers, statistics, and facts it turns out that still 65-75% of IT and software development projects still fail these days. This session will bring up 12 scenarios how everyone can help to ruin any software development project. It will be a sarcastic and funny way to look into this details. However, it is sad enough that the percentage these days is still so high. This session will give some insights.",
    "date_time": "3:30 PM Sunday",
    "tags": [
      "101"
    ]
  },
  {
    "author": "Ron Kleinman",
    "author_desc": "Ron most recently served as CTO of the SIF Association, an XML standard organization in the K-12 area. A 20 year veteran of Sun Microsystems, he co-founded the JavaPOS initiative, and has taught an evening section of Object Oriented Analysis and Design at De Anza College for the last 10 years, is the somewhat sheepish holder of several software patents and has been keynote speaker at multiple partner conferences and selected industry events. His current technology focus is on design patterns and application (rather than module) integration.",
    "title": "How to Think like a Software Architect",
    "desc": "Money Magazine identified Software Architect as its #1”Best Job” to hold in the U.S. in 2015 (http://money.cnn.com/gallery/pf/2015/01/27/best-jobs-2015), and its practitioners earned half again more than either of the top two finishers. If you have prior exposure to an object oriented programming language and have ever wondered what a Software Architect actually “does” for a living, this is the course for you. We tackle complex “back office” problems like the entire Student Registration System at a typical College Such problems should be especially interesting to those who desire to understand the boundaries of software components in large organizations and how they interoperate to support important use cases (ex: Student enrolls in a Course). \n\nSoftware Architects deeply “think about”, discuss and develop solutions for problems like these using the Object Oriented paradigm, in which the basic abstractions defined in the problem description are identified, fleshed out and manipulated. On truly large projects, it is only after both the system analysis and design are complete that the programmers get called in to implement and deploy the resulting solution.\n\n This is exactly the relationship between the architect and the craftsmen (plumbers, electricians and carpenters) during the building of a house. By necessity, they think about the house in very different ways. Here you will learn how to think like a Software Architect.",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "application scalability",
      "Architecture",
      "Design Patterns",
      "distributed systems",
      "Interoperability",
      "Modular Architecture"
    ]
  },
  {
    "author": "Ted Young",
    "author_desc": "Java Trainer and Coding Coach, specializing in Java, Spring, Object-Oriented Programming, and TDD. Create and deliver customized learning experiences for developers.",
    "title": "Human Learning: How We Learn & Why it Matters",
    "desc": "Learning how people (not machines) learn is not something we're taught in school, or what we were told is not backed by scientific evidence. Understanding how we learn, from a scientific point of view, helps us better communicate information to others so it will be understood and remembered.\n\nWe'll start with laying down an evidence-based foundation by looking at how we take in  and process information in working memory and, if we're lucky, gets stored in long-term memory. Like salmon returning to where they were born, getting the information into long-term memory is an upstream struggle, so we'll see ways to make that process easier by having images and words work together instead of fighting each other.\n\nWe'll then learn why forgetting is a good thing; mixing things up instead of cramming makes improves remembering; and attack some of the myths of learning. We'll find out there's the good way of making brains work hard during learning as well as bad ways, and see how learning is similar to isolating muscles when strength training.\n\nYou'll see examples along the way that will demonstrate applying this research and you'll come away with solid tips to confidently improve technical documentation, training manuals, video courses, and presentation slides.",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "Human Learning"
    ]
  },
  {
    "author": "Michael Palermo",
    "author_desc": "Michael is an international speaker/evangelist and has been sharing innovative technologies for nearly two decades.  Michael’s current passion is empowering developers to understand and integrate location services from HERE. Michael is a published author of technical books as well as online courses with Pluralsight. Prior to HERE, Michael evangelized “smart home” at Amazon on the Alexa team. Prior to Amazon, Michael evangelized web technologies at Microsoft. Get Michael’s latest insights by following him on twitter via @palermo4.",
    "title": "Integrating Location Services Using AWS Serverless Repository",
    "desc": "The demand for location services such as geocode, map images, points of interest, positioning, and routing are strong in today's technical solutions. In today's developer environment, the need to access services like this might require a microservices approach. This session will provide fundamentals on core location services and then walk through how to set up a service using the AWS Serverless Repository which will be tested with a simple HTML client. The method for creating the serverless application will be compared to other options.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "API",
      "AWS",
      "JavaScript",
      "JavaScript",
      "Location",
      "REST",
      "serverless"
    ]
  },
  {
    "author": "Vijo Cherian",
    "author_desc": "Maker at heart and professional programmer in bay area for more than 18 years, Vijo has worked on various areas of Linux system. Vijo has developed firmware for 10G ethernet card, a smart watch. Vijo has also delivered Ruby on Rails application.",
    "title": "Interfacing Lua and Ruby with C",
    "desc": "Scripting languages are popular today because of it’s reasonable learning curve and speed of development. But there are programming problems where scripting languages can not be used. Examples include talking directly to specific OS system calls not exposed to the scripting language (like raw sockets on Linux), or communicating with peripheral hardware devices.  Such system interfaces are often written in C. But how do we use them from scripting languages? We can  write interfaces from scripting languages like Ruby or Lua to C libraries. In this session, we will look at writing interfaces from Lua to C library. We will also look at writing code from Ruby on Rails to use C library.  You will not need to be experts of either language but some programming experience is presumed.\n\nA survey of mechanisms available to call native libraries or system level code from higher level application.",
    "date_time": "3:30 PM Sunday",
    "tags": [
      "Gnu/Linux",
      "Linux",
      "Ruby"
    ]
  },
  {
    "author": "Stephen Boesch",
    "author_desc": "I am a developer focusing on scalable apps for data pipelines and machine learning on Hadoop and Spark infrastructures.  My background is in Java/Oracle/ETL from 1996 until 2011, at which point I started to focus on Hadoop, Spark and Scala. My work has been at a mix of the familiar large Internet/Systems company names and startups.",
    "title": "Intermediate Scala: TypeClasses,  Currying, Performance, and More",
    "desc": "We will go through some of the more meaty components of scala. A proposed list of topics: \n\n\nContext Bounds   and Co/Contra Variance\nTypeTag and ClassTag\nType Classes and Self Types\nImplicits/Implicitly\nPartially Applied Functions and Currying\nFor .. yield tips and tricks\nStreams\nEither / Try\nParsing with Regex/ Json/ XML\nOperators\nParser Combinators\nIntermediate level use of Functional Combinators\nPerformance\nRevisiting For vs while:  let's really figure this out\nParallel collections\nCurrent state of affairs scala vs java\nSome best practices",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "Scala"
    ]
  },
  {
    "author": "Gayle Laakmann McDowell",
    "author_desc": "Gayle Laakmann McDowell is the founder and CEO of CareerCup.com and the author of three books:\n\nCracking the Coding Interview (Amazon.com's #1 best-selling interview book) \nCracking the PM Interview (product manager) \nCracking the Tech Career \n\nShe is an interview consultant, helping companies improve their interview process and coaching startups through acquisitions/acqui-hires. She is also an interview prep instructor, hired by Facebook to teach an interview prep class for external software developer candidates.\nGayle has worked as a Software Engineer for Google, Microsoft and Apple. She holds a BSE and MSE from UPenn in Computer Science, and an MBA from the Wharton School.",
    "title": "Interview Like Google (or not)-But Better!",
    "desc": "Google is (in)famous for its tough algorithm questions, and then making candidates code on a whiteboard. Other companies are partial to behavioral questions, factual/knowledge questions, and big lofty architecture and design questions. \n\nWe’ll discuss the different styles of technical and behavioral interviews for software developers. What’s right for your company? And how do you help candidates do their very best (and why is this so important)? How to keep your standards reasonable, but high and consistent? How do you limit your false negatives and false positives? \n\nHiring managers and recruiters will learn how to create a better process. Interviewers will learn how to select and ask better questions. And candidates will get to explore what happens on the other side of the hiring table. \n\nThis session will cover behavioral questions, coding questions, algorithm questions, knowledge questions, design questions, and code assessment/test tools.",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "Google",
      "Hiring",
      "interviewing",
      "management"
    ]
  },
  {
    "author": "Aza Tulepbergenov",
    "author_desc": "Aza is a Developer Programs Engineer on Actions on Google team. He helps write tools and samples related to Actions on Google. His goal is to help developers to have a great experience with Actions on Google.",
    "title": "Introduction to Actions on Google: Build Your First Action",
    "desc": "The Google Assistant is the conversational user interface that helps users get things done in their world. Actions on Google lets developers extend the Assistant to implement their own Conversation Actions. This talk will explain what you need to know to create your first Actions on Google project using the latest tools in conversational development: from designing a conversation, creating a DialogFlow agent, to implementing a backend integration using a Client Library for Actions on Google development with Firebase Cloud Functions.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "Voice User Interface"
    ]
  },
  {
    "author": "Upkar Lidder",
    "author_desc": "Upkar Lidder is a Full Stack Developer and Data Wrangler with strong experience in NodeJS and Python. Upkar has worked in the tech industry in a variety of roles over the past decade. Current passions include enjoying various kinds of Ramen, hiking, tennis and learning the magic behind ML. Always up for a chat over good coffee and/or beer.",
    "title": "Introduction to Chatbots",
    "desc": "Chatbots are the new craze, but it takes a good understanding of dialogs and communication to design and implement a usable chatbot. We will learn the underlying principles of a chatbot in this talk and then build one from scratch.\n\nIn this talk, you will learn the anatomy of a good chatbot and how the various pieces fit together. We will look at - Intents: to convey purpose or goal - Entities: make logical decisions based on user input - Dialogs: design a conversation - Slots: collect important information to fulfill an intent - Digressions and Handlers: handle unexpected conversations - Analytics: improve chatbot on an ongoing basis using metrics\nDownload the speaker slides and material",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "AI",
      "Chat",
      "Machine Learning",
      "Natural Language Processing"
    ]
  },
  {
    "author": "saishruthi swaminathan",
    "author_desc": "Saishruthi Swaminathan is a developer advocate and data scientist in the IBM CODAIT team whose main focus is to democratize data and AI through open source technologies. She received her Bachelor degree in Electronics and Instrumentation and Masters in Electrical Engineering specializing in data science. She is also  one of the active members in University AI research team. Her passion is to dive deep into the ocean of data, extract insights and use AI for social good. On a mission to spread the knowledge and experience, she acquired in her learning process through her blogs. \nLinkedIn : https://www.linkedin.com/in/saishruthi-swaminathan/\n\nMedium: https://medium.com/@saishruthi.tn",
    "title": "Introduction to lifecycle of Data science and IBM MAX",
    "desc": "Data Science is OSEMN (awesome) . Now in all our minds one question will definitely pop up, Why Data Science is awesome?. It is because it automagically lets you predict things and find unknown patterns as well as trends in your data. One of the crucial steps in the data science lifecycle is model development. This can be visualized as your toolbox and all algorithms as tools.Choosing the best tool is crucial as it directly enhance your business decision making.\n\nIn this talk, we will walk you through the life cycle of data science and introduce you IBM’s Model Asset Exchange (MAX). MAX provides a curated list of ready-to-run machine learning models for wide range of applications. We will explore how to use MAX models and also build own web app using MAX models.",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "AI",
      "Algorithms",
      "Analytics",
      "App Deployment",
      "Machine Learning",
      "microservices"
    ]
  },
  {
    "author": "Nik Kalyani",
    "author_desc": "Entrepreneur, co-founder/cto WhenHub, co-founder DotNetNuke; blockchain tinkerer; STEAM educator; Microsoft MVP; maker; geek; creative thinker; husband; dad",
    "title": "Introduction to Smart Contract Development",
    "desc": "The Ethereum Virtual Machine (EVM) has made blockchain-based Smart Contracts mainstream. In this session, I will step through the process of creating an Ethereum blockchain Smart Contract using the Solidity programming language (no prior Solidity knowledge required). Next, we'll test the contract using Mocha, and Ganache blockchain simulator. Finally, we'll deploy the contract to the Ropsten testnet. Smart Contract development has lots of gotchas – this session will help you learn the basics while avoiding the pain. This session is well-suited for Javascript developers wishing to get started with blockchain technology.",
    "date_time": "9:15 AM Sunday",
    "tags": [
      "blockchain",
      "Ethereum",
      "JavaScript",
      "smart contracts",
      "solidity"
    ]
  },
  {
    "author": "Antony Ross",
    "author_desc": "Antony Ross is a consultant specializing in data science and machine learning applied to sports performance. He has worked closely with USC and UCLA and is presently involved with the Recurse Center in New York researching deep learning and voice recognition.",
    "title": "Introduction to Understanding Deep Learning",
    "desc": "The goal of this non-intimidating session is to make deep learning more approachable. We will unravel some of the complexities. There will be no coding. We will differentiate between machine learning and the sub-field of deep learning, and pursue a more intuitive understanding of how deep learning is implemented. Primarily, we will explore neural networks and their most common architectures, focusing on the deep neural networks that are most effectively used with visual data such as image recognition (e.g., Convolutional Neural Networks), and those most amenable to sequential data like natural language processing (e.g., Recurrent Neural Networks). The aim is for attendees to become conversant with deep learning and to acquire a clearer understanding of the concept as well as its application.",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "AI",
      "Big Data",
      "Data Science",
      "Deep Learning",
      "Machine Learning"
    ]
  },
  {
    "author": "Corey Weathers",
    "author_desc": "Corey Weathers is passionate about solving human problems with technology. Before joining Twilio, he worked as a software developer, tester, performance engineer, and consultant with Microsoft and Intapp. With his deep knowledge of .NET, he is always looking for new ways to demonstrate the magic of software by building cross platform applications that satisfy developers and users alike.",
    "title": "Intro to Blazor, WebAssembly and Razor in .Net",
    "desc": "In this talk, we will walkthrough the Blazor Framework, Microsoft's approach to building web applications using WebAssembly & Razor Page. We will talk about what Blazor is, how to create a Blazor application, show off some of the things you can do with Blazor, and briefly address some features that are still in development. At the end of this talk, attendees should know how to get started building web applications using the Blazor framework.",
    "date_time": "9:15 AM Sunday",
    "tags": [
      ".NET",
      "ASP.NET",
      "Blazor",
      "C#",
      "Visual Studio",
      "Web"
    ]
  },
  {
    "author": "Siamak Ashrafi",
    "author_desc": "(Ash) is Bio-Computational researcher@day working on bio-markers (publications*) & CTO@night of technology companies (patents*). His frequent code-a-thon wins have gone on to become published Apps (iOS & Android*). As a thought leader in wearable/mobile development he is an enthusiastic teacher / speaker  helping to promote the ecosystem (fashion* & technology*). But what he would really like is to get a major sponsor in all three phases of water. (Snowboarding* [solid], Surfing* [liquid] & Kiteboarding* [vapor])",
    "title": "iOS: The Best Parts",
    "desc": "This session starts with a review of how to build “Real World” not “Hello World” iOS Apps. We dive into the best architecture, design patterns, libraries, components, tools, tips, tricks and new features from WWDC 2018. After setting the context we start to learn the language using “A Swift (5.0) Tour” Playgrounds. \n\nFollowed by “Start Developing iOS Apps (Swift)”. “Start Developing iOS Apps (Swift) is the perfect starting point for learning to create apps that run on iPhone and iPad. View this set of incremental lessons as a guided introduction to building your first app—including the tools, major concepts, and best practices that will ease your path.” \n\nWe finish the session by examining the similarities between Kotlin & Swift / Material Design & Apple HIG / Android Studio & XCode / Play Store & App Store. The similarities will shock you :-)\nDownload instructions to be prepared for this class",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "App Deployment",
      "Apple",
      "Architecture",
      "Design Patterns",
      "iOS",
      "Mobile",
      "Swift"
    ]
  },
  {
    "author": "Jeremy Foster",
    "author_desc": "Educated in computer engineering and mathematics. Industry experience in education, aerospace manufacturing, and insurance. Joined Microsoft February 2012 and consider it my role to inform and inspire developers. When I'm not working, I'm hanging out with my wife and son, hiking and camping, sailing, scuba diving, or working on my house and yard. Find me at @codefoster and codefoster.com.",
    "title": "IoT on the Edge",
    "desc": "I get really excited when I think about a fully connected world where even all of the little things are connected to the cloud and each other, where data can flow freely around the globe, and where compute is a commodity that may just as well happen in my sock as in a datacenter.\nMicrosoft offers some highly capable IoT services in the cloud, but we're also providing a very sensible means to move workloads to the edge. Doing so often makes a lot of sense and saves you time, money, or both.\nIn this session, we'll see where IoT Edge fits with cloud services, we'll learn how to set it up on a PC or an IoT device, and we'll build some edge modules that do real work.",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "Azure",
      "edge",
      "IoT",
      "JavaScript",
      "JavaScript",
      "NodeJS"
    ]
  },
  {
    "author": "Burr Sutter",
    "author_desc": "A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat’s Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world’s leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company’s premier annual event.",
    "title": "Istio on Kubernetes: Smart Canaries, Dark Launches and Chaos",
    "desc": "Java Microservices on Istio+Kubernetes.  We will be live demo’ing, the Istio Service Mesh on top of Kubernetes/OpenShift. Key use cases include easy distributed tracing via Jaeger, clever canary deployment scenarios, circuit breakers, network chaos injection and the beauty of the dark launch. How do you achieve the velocity of many deploys per day? Small batch sizes, well-architected Java apps and the capabilities of a service mesh, taking your linux container, Kubernetes & microservice capabilities to the next level. In this session, you will witness several of the new super powers of Istio on Kubernetes and OpenShift. Things like distributed tracing (Jaeger) and metrics, clever canary deployments, chaos injection, circuit breakers and the dark launch.",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "Cloud",
      "Java",
      "Kubernetes",
      "microservices"
    ]
  },
  {
    "author": "Arun Gupta",
    "author_desc": "Arun Gupta is a Principal Open Source Technologist at Amazon Web Services. He has built and led developer communities for 12+ years at Sun, Oracle, Red Hat and Couchbase. He has deep expertise in leading cross-functional teams to develop and execute strategy, planning and execution of content, marketing campaigns, and programs. Prior to that he led engineering teams at Sun and is a founding member of the Java EE team.\n\nHe has extensive speaking experience in more than 40 countries on myriad topics and is a JavaOne Rock Star for four years in a row. Gupta also founded the Devoxx4Kids chapter in the US and continues to promote technology education among children. A prolific blogger, author of several books, an avid runner, a globe trotter, a Docker Captain, a Java Champion, a JUG leader, NetBeans Dream Team member, he is easily accessible at @arungupta.",
    "title": "Java developer’s journey in Kubernetes land",
    "desc": "Deploying your Java application in a Kubernetes cluster could feel like Alice in Wonderland. You keep going down the rabbit hole and don’t know how to make that ride comfortable. This no-slide and code-only session will explain how a Java application consisting of different microservices can be deployed in a Kubernetes cluster. Specifically, it will explain the following:\n\nShow a Java application with three microservices\nHow this application is packaged as a Docker image\nCreate Kubernetes manifests\nHow Helm charts are created and hosted in a Helm repository\nTest in a local environment\nAttach debugger\nInstall Istio in k8s, show service visibility\nInstall k8s on AWS\nMigrate application from a local cluster to a cluster on the Cloud\nSetup deployment pipeline using CodePipeline\nUse an Alexa skill to scale the application\nChange application, show A/B using Istio",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "Java",
      "Kubernetes"
    ]
  },
  {
    "author": "Obaidur Rashid",
    "author_desc": "Obaidur Rashid (OB) has ~20 years of experience in Software Development.  He has built highly scalable web/mobile applications across multiple domains.  OB is an evangelizer of agile practices and has immense experience in building high-performance teams onshore and offshore.  He is also a regular speaker at industry events.\n \nCurrently, OB leads Engineering for the CA Privileged Access Manager product within the Security BU at CA Technologies.  Before being asked to take on this challenge, he was the VP of Engineering for the CA PPM (Clarity) product also at CA Technologies.  Before CA, he was the head of Engineering for the #1 cloud-based Talent Management suite of applications for the mid-market namely, Taleo Business Edition at Oracle/Taleo.  Prior to that, he served as the Director of Engineering at StarCite responsible for all application development.  Incidentally, he started his career at Oracle where he moved up to the role of an Architect and led key strategic initiatives. \n \nOB has a passion for teaching; he taught Database and advanced web application development courses in Java to college students on the side.  OB has a Bachelor’s and Master’s degree in Computer Science.",
    "title": "Leadership Lessons People Learn the Hard Way",
    "desc": "What does it take to succeed as an engineering leader? Years of experience have taught Obaidur Rashid, VPE, CA Technologies, that there are no cookie cutter approaches to leadership or management. Nevertheless, he's found you should develop a set of principles over time that can guide you through this perilous journey.\n\nOB will share some of those principles, best practices and tips with us to ready us for managing software people and teams in a world that is constantly changing.\n\nIn this talk, you will learn the art and science of leading that will add to your toolset, give you an edge over others and provide you with the foundation for delivering outstanding results.\n\nYou will learn the lessons that every leader eventually learns the hard way.",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "leadership"
    ]
  },
  {
    "author": "Gautam Gupta",
    "author_desc": "Architect in Lending Club\nFinTech Expert\nGreat in numbers!\nPassionate about use of technology in Finance, Banking and Payments.\nAWS, Java, Open Source Enthusiast",
    "title": "Learn Basics of Artificial Intelligence with TensorFlow",
    "desc": "In this session, you will learn the basics of Artificial Intelligence with a hands on TensorFlow demo. We will cover some theory of AI and how to create an AI model.\nWe will create a prediction model based on TensorFlow and Python. It will demonstrate the capabilities of TensorFlow for creating your first Artificial Intelligence program. \nThe emphasis will be equally distributed on theory and practice in this session. It is a beginner level session to learn the first hand experience of Artificial Intelligence.",
    "date_time": "9:15 AM Sunday",
    "tags": [
      "AI"
    ]
  },
  {
    "author": "Marcus Hellberg",
    "author_desc": "Marcus Hellberg is the lead developer advocate at Vaadin, helping developers learn about modern web technologies like Web Components and Progressive Web Applications. His background is in embedded systems but has worked on everything web related for the past 15+ years.",
    "title": "Learn PWA With Live Coding (Progressive Web App)",
    "desc": "In this presentation, we'll take a hands-on approach to learning PWA by building a simple PWA from scratch. I want to show you that it's easier than you think and that much of what's needed are things you already know. After the talk, you'll be able to go and build your own PWA.",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "App",
      "Coding",
      "JavaScript"
    ]
  },
  {
    "author": "Todd McLeod",
    "author_desc": "Champion of world class online instruction; teaching online since\n1997; honored as one of California’s top community college\ninstructors; studied online education at UC San Diego; started the\nOnline Teacher Training Program and taught college faculty in central\nCalifornia how to teach online; one of the world’s leading trainers in the Go programming language which is currently the\nhighest paying programming language in America; teacher to 528,918\nstudents last year online; founder of Greater Commons; motivating,\ninspiring, and teaching teachers how to teach online at their greatest\npotential - this is Todd McLeod, working every day for the greater\ncommon good.",
    "title": "Learn To Build A Website with Golang",
    "desc": "The Go programming language is the best choice for web programming today. \n\nCreated by Google, the Go programming language allows you to build web services that easily scale. \n\nIn this session, you will learn how to build a web server in Go and will see how to program routes to handle requests and serve responses. \n\nFor three years, it has been my privilege to teach the Go Programming Language and Web Development With Go at both the college and university level. I have taught Go as an introductory programming course and I have taught Go to graduate students in computer science. In addition, I have taught over 50,000 students online the Go Programming Language. \n\nI am looking forward to sharing with you my passion for Go, along with the great repositories I have developed over the last two years to help people learn Web Development With Go.\nDownload instructions to be prepared for this class\n\nDownload the speaker slides and material",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "App",
      "golang",
      "Web",
      "Web Performance",
      "WebAPI"
    ]
  },
  {
    "author": "Tony Nguyen",
    "author_desc": "Tony Nguyen is a computer software professional with over 25 years of experiences.\nCurrently he is a software architect at a privately-funded startup Orna.AI, after a 20-year career in software engineering at Cisco Systems.\nTony is a faculty at ITU since 2014. \nTony also teaches various Computer Information System courses at De Anza College and San Jose City College. \n\nTony is a graduate of Santa Clara University with a Master degree in Computer Engineering in 1993.\nHe also completed master-level certificates in Information Security and Project Management at the Villanova University.\nTony was awarded the U.S. Patent 6546420 titled \"Aggregating information about network message flows\" for his innovative work with colleagues at Cisco Systems in 2003.\n\nTony Nguyen research interests include: cloud system security, artificial intelligence, machine learning, big data analytics",
    "title": "Machine learning using the Keras Python library",
    "desc": "This session introduces the Keras Python library that can simplify machine learning. The Keras framewor achieves its goal to be user-friendly, modular, extensible. Keras not only works with Tensorflow library, it also works other libraries such as CNTK and Theano.\n\nWe will explore the facilities of Keras framework that provides a higher-level abstraction than the Tensorflow Python library. For example, instead of having to create an elaborate computation graph in Tensorflow with several steps, using the Keras library can reduce the necessary amount of steps by 60% or more. \n\nWe will use several practical examples of machine learning such as the random forest method, the recurrent neural network and convolution neural network as demonstration of the use of Keras library.",
    "date_time": "2:15 PM Sunday",
    "tags": [
      "Data Science",
      "Deep Learning",
      "Machine Learning",
      "Python"
    ]
  },
  {
    "author": "Roman Zhovtulya",
    "author_desc": "Roman has co-founded WebServiceCenter Group in early 2004 and has since been responsible for strategic management and IT.\n\nHe received a Master's Degree in \"Communications and Media Engineering\" from Offenburg University (Germany) and has established and managed a number of technology initiatives there. One of them being \"InternetServiceCenter\" - an innovative company-like software development agency within the University.",
    "title": "Manage your life: Web-based goal, time, project, health management",
    "desc": "This session is an attempt to not only offer some fresh approaches to time/goal management, but also to engage in a discussion about new ideas and look at some thought-provoking concepts for total life management, that are made possible by a holistic approach to web-based application development nowadays. \n\nWe'll start by reviewing some classic approaches and theories for time and project management (GTD, books \"The Time Trap\", \"One minute manager\", etc), discussing goal-based time/project management and speculating about the future trends. \n\nThen we'll take a look at some popular web-based applications for time/goal/project management and compare them to several integrated, \"all-in-one\" solutions. \n\nAt the end, we'll engage in a lively discussion on what the future for these approaches and applications will be and how to best use them. \n\nSome of the ideas/points will be quite controversial with far-reaching implications (security, privacy, etc), so be sure to arm yourself with some real-life questions, examples and concerns. Hopefully, we'll have an intellectually-stimulating discussion where everybody will learn something new and get a fresh perspective on how to make the most of their potential.",
    "date_time": "2:15 PM Sunday",
    "tags": [
      "goal management",
      "knowledge management",
      "Project Management",
      "time management"
    ]
  },
  {
    "author": "Ron Lichty",
    "author_desc": "Ron Lichty has been managing and, more recently, consulting in managing software development and product organizations for over 25 years. Before that, as a programmer, he coded compiler code generators, was awarded patents for compression and security algorithms he designed and coded for embedded microcontroller devices, wrote two widely used programming texts, and developed the computer animation demo that Apple used to launch and sell a next-generation line of PCs. The primary focus of his consulting practice has mirrored what he did as a manager: untangling the knots in software development. As Ron Lichty Consulting, he takes on fractional Interim VP Engineering and Acting CTO roles, trains teams in scrum, transitions teams to agile, trains managers in managing software people and teams, and advises organizations and coaches teams to make their software development “hum.” His 450-page book, Managing the Unmanageable: Rules, Tools, and Insights for Managing Software People and Teams, was recently released as video training - LiveLessons: Managing Software People and Teams - both from Pearson and on O’Reilly’s Safari Network. He also co-authors the biannual Study of Product Team Performance.",
    "title": "Managing in an Agile World",
    "desc": "Agile is based on self-organizing teams, so if teams organize themselves, what do managers do?\n\nIt turns out that managers can play a critical role both in agile adoption and in agile success long-term.\n\nUnfortunately, scrum training mostly doesn’t address the role: when trainers and coaches sketch the structure of a scrum team, they almost never include a manager. \n\nManagers not knowing their changed role can be a problem: A frequently cited barrier to agile adoption is managers who don't know what to do when their teams become self-managing. When they're not included in training, how would they (or anyone else, for that matter) know the contributions to which managers need to apply themselves. Worse, their larger organizations often lay down expectations for them that are incompatible with agile. \n\nAgile has shifted the old roles and responsibilities. A manager bent on command-and-control is clearly a barrier to agile adoption. But managers who take a hands-off approach or are unclear on the contribution they must make will almost certainly stymie adoption, as well.\n\nRon Lichty echoes many of the early agile thought leaders: managers have critical roles to play in enabling success, both in transitioning to agile and in agile itself. \nThis session is about managers’ critical contributions, and is for managers, for prospective managers, for team leads, and for members of teams thinking through how to make their teams the best teams they’ve ever been part of.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "Agile",
      "culture",
      "management",
      "Performance",
      "Scrum",
      "team building",
      "Team Management"
    ]
  },
  {
    "author": "Brad Irby",
    "author_desc": "Brad is an accomplished .NET software architect specializing in Domain Driven Design and Event Driven Architectures.  Over his 30 year professional career, Brad has built web applications for Adidas, Kashi, Gap, Wells Fargo, Bank of America, Aptos, and many others.  Brads specialty is migrating existing .NET applications to a DDD architecture and EDA without system downtime.\n\nBrad has been the organizer of the San Francisco and Silicon Valley .NET user groups, and is frequent speaker on technical software topics throughout the US, South America, and Europe.\n\nBrad has written a book on Reengineering .NET published by Adison Wesley.",
    "title": "Microservices and Serverless Speaker Panel – The Road Ahead",
    "desc": "We have all heard for a while that microservices are the solution to all of our problems.  Now serverless is emerging as an even smaller component of the new way of building applications piece by piece.  In our zeal to adopt the latest in architectural approaches, have we given sufficient thought to where they are going or what comes next?\n\nIf you are considering building an application with a microservice or serverless based architecture, come to this panel of experienced cloud developers and architects and learn what these technologies can do for you now, and what they will do in the future.  Ask our panel questions on what works, what doesn't, and how to prepare today for the technology that's coming next.",
    "date_time": "9:15 AM Sunday",
    "tags": [
      "Architecture",
      "microservices",
      "Modular Architecture",
      "serverless"
    ]
  },
  {
    "author": "Chris Richardson",
    "author_desc": "Chris Richardson is a developer and architect. He is a Java Champion, a JavaOne rock star and the author of POJOs in Action, which describes how to build enterprise Java applications with frameworks such as Spring and Hibernate. Chris was also the founder of the original CloudFoundry.com, an early Java PaaS for Amazon EC2. \n\nToday, he is a recognized thought leader in microservices and speaks regularly at international conferences. Chris is the creator of Microservices.io, a pattern language for microservices, and is writing the book Microservice Patterns, which is available as a Manning MEAP. He provides microservices consulting and training to organizations that are adopting the microservice architecture and is working on his third startup Eventuate, an application platform for developing transactional microservices.",
    "title": "Microservices: Decomposing Applications for Testability and Deployability",
    "desc": "Successful applications have a habit of growing.  What’s more, the rate of growth increases over time because the development team typically gets larger. Eventually, the application will become extremely large and the organization ends up in monolithic hell. All aspects of development, testing and deployment are slow and painful. It’s impossible for the developers to keep up with the demands of the business. And, to make matters worse the application uses a technology stack that is increasingly obsolete.\n\nThe way to escape monolithic hell is to migrate to the microservice architecture. In this talk, you will learn about the essential characteristics of microservices. I describe the benefits and drawbacks  of the microservice architecture and when it makes sense to use it. You will learn about the design problems you will encounter when using microservices. I describe how to solve this problems by applying the microservices pattern language. You will learn how the microservice architecture accelerates the delivery of large, complex applications.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "Architecture",
      "distributed systems",
      "microservices"
    ]
  },
  {
    "author": "Nuri Halperin",
    "author_desc": "Nuri Halperin consults, develops software, and teaches with passion. He designs and builds systems, websites and business applications. He's been getting things done for a variety clients small and large. He authors courses for pluralsight.com. \n\nA frequent speaker at tech events, he enjoys interacting and helping people reach that \"Aha!\" moment. \n\nNuri is the inaugural recipient of MongoDB's William Zola Outstanding Contributor Award, and is a MongoDB Master.\n\nOwner of http://plusnconsulting.com\nAuthor at Pluralsight http://www.pluralsight.com/author/nuri-halperin",
    "title": "MongoDB Aggregation like a Champ!",
    "desc": "This session is all about the aggregation framework in MongoDB. It explains the pipeline architecture, major operators and how to put it all together. \n\nAlso covered will be some new operators in MongoDB 3.4 , and what to do about joins!\n\nIf you are still exporting data just to do dig into your data or do aggregation, there's a much better way!",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "Big Data",
      "BigData",
      "Database",
      "MongoDB",
      "NoSQL"
    ]
  },
  {
    "author": "Nuri Halperin",
    "author_desc": "Nuri Halperin consults, develops software, and teaches with passion. He designs and builds systems, websites and business applications. He's been getting things done for a variety clients small and large. He authors courses for pluralsight.com. \n\nA frequent speaker at tech events, he enjoys interacting and helping people reach that \"Aha!\" moment. \n\nNuri is the inaugural recipient of MongoDB's William Zola Outstanding Contributor Award, and is a MongoDB Master.\n\nOwner of http://plusnconsulting.com\nAuthor at Pluralsight http://www.pluralsight.com/author/nuri-halperin",
    "title": "MongoDB First Steps",
    "desc": "MongoDB is a database that has become the go-to choice for many. This session is an introductory to Mongo. It covers the basics of the database: server, client, and syntax. We will go over some NoSQL and document oriented modeling topics, and show how easy it is to get up and running. The talk is geared towards beginners, DBAs, developers, or information workers who want to learn more about Mongo and how to get started.",
    "date_time": "9:15 AM Sunday",
    "tags": [
      "Big Data",
      "Database",
      "Development",
      "NoSQL",
      "reporting"
    ]
  },
  {
    "author": "Sastry Vedantam",
    "author_desc": "Sastry has 16+ years of rich, robust and diversified IT and Functional experience in multiple technologies spread across various domains, businesses and verticals.  His strengths are in pre-sales/program/delivery/account management and on time and on budget delivery of large projects adhering to the quality norms and to the utmost customer satisfaction.  He also has strong and proven expertise in providing Architectural Consultancy to global projects.\n\n\nJoined Sun Microsystems in 2008 as Enterprise Solution Architect handling Deployment Architecture using JavaCAPS ( Middleware) applications. After MySQL Merger in to Sun and then later into Oracle worked different technologies including MySQL , Fusion Middleware Solutions. Currently working as sr. technical Consultant in the MySQL team.",
    "title": "MySQL as  SQL/NoSQL Database with Document Store Features",
    "desc": "MySQL is the open Source Database with both SQL and NoSQL Features. The new Document Store Feature will allow  Developers to build the solution without any Relation Model Design. it means they can build NoSQL Development with JavaScript/PHP/Python languages and build CRUD based applications without compromising the Relations DB features like ACID /Transactions Features. \nDownload the speaker slides and material",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "Database",
      "JavaScript",
      "mysql",
      "NoSQL",
      "PHP",
      "Python"
    ]
  },
  {
    "author": "Bill Enright",
    "author_desc": "Developer of lifta, a functional library for asynchronous work at the application level. 35+ years of experience in software development. Software engineering manager in the life sciences field. JavaScript and Node enthusiast in the wee hours. Strong interest in using functional approaches to building games and apps.",
    "title": "Need a lifta?",
    "desc": "lifta: using functional techniques to compose asynchronous work at the application level with JavaScript\n\nTake control of branching, looping and error handling with asynchronous function arrows. We can compose these constructs with first-class function wizardry instead of getting stuck in \"callback hell\" or hopelessly trying to understand a rat's nest of functions using async/await. When promises leave you flat...you need a lifta.\n\nWe'll explain how it works without getting bogged down in the usual functional programming gobbledygook, and we'll examine real-world, practical working examples in web services and apps.\n\nhttps://github.com/enright/lifta\nhttps://github.com/enright/lifta-node\nhttps://github.com/enright/lifta-dynamodb\nhttps://github.com/enright/lifta-s3\nDownload the speaker slides and material",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "Asynchronous Programming",
      "functional programming",
      "JavaScript",
      "JavaScript"
    ]
  },
  {
    "author": "Sara Daqiq",
    "author_desc": "I love building great products to help businesses succeed in their goals. I currently work at Okta as a Developer Support. I work with Authentication and authorization every day. My work here is a beautiful intersection of hard skills and soft skills. I resolve customer’s most complex problems revolving around our platform products. In my free time, I enjoy biking, yoga, and surfing… Surfing the internet that is.",
    "title": "OAuth 2.0 and OIDC",
    "desc": "How can application developers provide users with secure authentication without investing a lot of time and instead focus on building their application’s core functionality? With OpenId Connect (OIDC) you give the authority to a trusted provider to prove that the user is who they say they are. OIDC is built on top of OAuth 2.0 so it has all functionality of OAuth 2.0 plus more. In this talk, We explore how do applications talks to each other to get access to resources on behalf of the user via OIDC. We will also walk through how to get access and Id token with OpenId Connect. \n\n\nOutline: \n\n- What is OAuth 2.0 and what problem does it solve \n\n- What is OIDC and why was it built on top of OAuth \n\n- What is the difference between authentication and authorization\n\n- walk-through of How to get JSON web token using OpenID Connect flow",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "Authentication",
      "OAuth",
      "sec"
    ]
  },
  {
    "author": "Ted Young",
    "author_desc": "Java Trainer and Coding Coach, specializing in Java, Spring, Object-Oriented Programming, and TDD. Create and deliver customized learning experiences for developers.",
    "title": "Order a Burger with Spring Boot and Vue.js",
    "desc": "See how to create a well-tested and architected meal-ordering application using Modern Java and Spring Boot for the back-end and Vue.js for the front-end. Unit testing (JUnit and AssertJ) and the Ports & Adapters (aka Hexagonal) architecture will play a starring role. You'll find out how this architecture compares with traditional horizontally layered architectures and how Ports & Adapters leverages Domain-Driven Design principles that fits well with both \"monolithic\" and microservice-based systems to keep your code and system clean.\n\nThis session assumes you have an understanding of Java and HTTP APIs (aka RESTful). \n\n*No actual burgers will be served.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "Boot",
      "Java",
      "Spring",
      "Unit Testing",
      "Architecture"
    ]
  },
  {
    "author": "Ramona Maxwell",
    "author_desc": "Ramona Maxwell | Enterprise Platform Architect | 650-800-3995\n\nPivotal Cloud Foundry Regional Lead at Magenic Technologies, Inc. \ncreating platform solutions for enterprise and government clients. Recent blog posts:    \nhttps://magenic.com/thinking/enterprise-content-migration-success-factors  |---|  \nhttps://magenic.com/thinking/harvesting-brain-power-the-gift-of-neurodiversity-in-tech  |---|  https://magenic.com/thinking/enterprise-collaboration-should-you-buy-an-intranet-in-a-box",
    "title": "Platform Agnostic Application Development with Pivotal Cloud Foundry",
    "desc": "For companies that no longer wish to be tied to a model of on-premise deployment and maintenance for critical applications, Pivotal Cloud Foundry offers the ability to deploy new and existing applications to any major cloud platform with a single command. Further benefits include removing management headaches around achieving scalability, high availability and redundancy. The ability to continuously integrate new features via Blue-Green Deployment means time to market is short! This session will feature a high overview of this amazing framework, and then conclude with a short lab that will equip you to take it for a test drive on your own.\nDownload the speaker slides and material",
    "date_time": "9:15 AM Sunday",
    "tags": [
      "Cloud Foundry",
      "Design Patterns",
      "Development",
      "DevOps",
      "Pivotal",
      "serverless"
    ]
  },
  {
    "author": "Nic Raboy",
    "author_desc": "Nic is a Senior Developer Evangelist for HERE Technologies. He has released several native and hybrid mobile applications to iTunes and Google Play and writes about his development experiences related to making web and mobile app development easier to understand. He has experience in Unity3D, Apache Cordova, Java, NoSQL, SQL, and Node.js.",
    "title": "Powering an API with GraphQL, Golang, and NoSQL",
    "desc": "Remember RESTful APIs? Remember how you had to create an API endpoint for every little thing and as your business grew, so did the data payloads of your API endpoints? Remember how tiring it is to consume data from large APIs via a frontend like Angular or React?\n\nTake GraphQL, a new concept that allows you to query your APIs rather than just consume data from them. Using GraphQL, you can query for data from your frontend using a single endpoint and no specific amount of data complexity.\n\nIn this session, learn how to create an API powered by GraphQL using the Go programming language and a NoSQL database.",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "golang",
      "NoSQL"
    ]
  },
  {
    "author": "Rob Vieira",
    "author_desc": "As a kid getting the rare opportunity to touch a terminal back in a day where computers took up rooms or even buildings, Rob knew this was something very cool. And so began the lifelong relationship between Rob and technology.\nRob would write his first book in 1998, and discovered he had hit a nerve in the industry, igniting a new genre of books oriented around database development in a space where books had just focused on administration.\nSince then, Rob has sold over 250,000 books on data related topics, and went on to design systems and lead teams building products that often handled regulated and other sensitive information. \nIn recent years, he's focused on building high retention teams based on ethical leadership.",
    "title": "Privacy and Data Ethics: Just because we can, doesn't mean we should.",
    "desc": "Every second and every day data is created. By 2020, it is estimated the average person with an online presence of any kind will create 1.7 megabytes per second, or slightly less than 150GB per day. The digital universe is expected to be up to 44ZB (44,000 exabytes).\nIt is often said that today, the real value of a business is its data, so there is a natural tendency to collect everything we can, but should we?\nEach piece of data we collect exposes our organization to new legal and ethical risks that may prove to be expensive, or even deadly to the organization.\nIn this session, we'll explore some of the ethical and legal issues we face when we collect data, and how those impact our culture, our business outlook, and our relationship with those we keep data on.",
    "date_time": "9:30 AM Saturday",
    "tags": [
      "Business",
      "Compliance",
      "data",
      "Database",
      "Ethics",
      "Privacy"
    ]
  },
  {
    "author": "Paul Everitt",
    "author_desc": "Paul is the PyCharm and WebStorm Developer Advocate at JetBrains. Before that, Paul was a partner at Agendaless Consulting and co-founder of Zope Corporation, taking the first open source application server through $14M of funding. Paul has bootstrapped both the Plone Foundation and the Python Software Foundation. Before that, Paul was an officer in the US Navy, starting www.navy.mil in 1993.",
    "title": "Productive React/TypeScript/TDD: Love Story from Hell",
    "desc": "React is the most popular frontend framework and TypeScript is one of the hottest languages. The combination? Common, but barely. With test-driven development? Thin ice.\n\nIn this hands-on session we write a simple React counter application in TypeScript. But with a different approach: instead of constantly reloading a browser, we write tests in Jest and only visit the browser as a final step. We also see how to put the WebStorm IDE to work to get the productivity benefits promised by TypeScript.",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "JavaScript",
      "React",
      "TDD",
      "TypeScript"
    ]
  },
  {
    "author": "Douglas Crockford",
    "author_desc": "Douglas Crockford discovered the JSON Data Interchange Format. He is also the author of _JavaScript: The Good Parts_. He has been called a guru, but he is actually more of a mahatma.",
    "title": "Q&A With Douglas Crockford",
    "desc": "If you've never been to a Q&A session with Douglas Crockford, you are in for a treat.  Ask anything you want, then be prepared for the answer.  This is the follow on session to Douglas Crockford's first session where he talks about How JavaScript Works (his new book).",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "JavaScript",
      "JSON"
    ]
  },
  {
    "author": "Soham Mehta",
    "author_desc": "Soham is the founder of Interview Kickstart, which is a bootcamp for technical interview preparation.\nThe bootcamp is laser-focused on re-teaching Data Structures, Algorithms and System Design, to working engineers, who desire to work at high-growth, career-launching tech companies in Silicon Valley. \nPrior to InterviewKickstart, Soham was a Director of Engineering at Box and an early engineer there. He helped Box's technical teams grow from 5 to 250 engineers over a span of 5 years. This meant living and breathing the interviewing machine exploring all its nooks and corners, and ups and downs. \nPrior to Box, Soham has also worked at eBay and Microsoft.",
    "title": "Recursion and Dynamic Programming for technical interviews",
    "desc": "It is no secret that the bar to crack technical interviews is only getting higher with each passing year. That's especially true of good companies, viz. think Big4 and pre-IPO startups. Recursion is pervasive in many of these interviews. Whether it is dealing with basic algorithms on Sorting, or whether it's simple data-structures like Linked Lists, Arrays & Strings, or whether it's about traversing complex data-structures like Tries and Graphs, you're bound to come across Recursion-based solutions. Recursion can be a difficult concept to grasp for many of us, but it doesn't have to be. It's one of those things that can be reigned in with practice, and once reigned, it gives dividends all through your practice. Once you're comfortable with recursion, Dynamic Programming also becomes easier, because Recursion is the first logical step to solving many DP problems. In this session, we'll walk through some Recursion and DP problems, until the time permits.\nDownload instructions to be prepared for this class\n\nDownload the speaker slides and material",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "Algorithms",
      "Career",
      "Coaching",
      "Coding",
      "Data Structures",
      "interviewing",
      "Job Hunting"
    ]
  },
  {
    "author": "Dave Nielsen",
    "author_desc": "As Head of Ecosystem Programs, Dave uses emerging technologies and open source projects like Microservices, Serverless & Kubernetes to bring the magic of Redis to the broader community. Dave has extensive ecosystem experience from his years of engagement in the web, cloud and big data trenches. Prior to Redis Labs, Dave led the relationship between Intel’s Deep Learning in Apache Spark project and public cloud providers; and at PayPal where he helped pioneer web api developer evangelism.",
    "title": "Redis in Containers, and Kubernetes and Serverless ... Oh My!",
    "desc": "According to Docker Hub Explore, Redis is the most popular database in containers. Some even say Redis is the most popular database on AWS. While running one Redis in one container is limiting, it can be very useful. But deploying Redis in a cluster of containers can give you scale and reliability your startup needs. In fact, some companies run 100's of instances of Redis as their primary database. In this talk, I'll share 5 popular use cases for Redis in Containers, Kubernetes and even Serverless. And I'll show you how to package Redis for deployment via Docker & Kubernetes. If I'm feeling gutsy, I might even show you how to run Redis on Windows.",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "Cloud",
      "containers",
      "DevOps",
      "Docker",
      "Kubernetes",
      "microservices",
      "Redis"
    ]
  },
  {
    "author": "Peter Thoeny",
    "author_desc": "Founder & CTO of TWiki.org, a leading enterprise collaboration platform. Trying to get more open source contributors hooked on TWiki. Inventor of Structured Wikis. Co-author of Wikis for Dummies. Speaker. Open source & enterprise collaboration advocate.",
    "title": "Regular Expressions, To Match Or Not, That is the Question",
    "desc": "A regular expression (regex for short) is a powerful language to describe a search pattern to analyze and modify text. Initially used in Unix text processing utilities ed and grep, many programming languages now have built-in support for regular expressions, such as Perl, Ruby, AWK, and Tcl. Others support it via a standard library, such as .NET languages, Java, Python and C++. This talk assumes you dabbled with regular expressions before, and teaches you how to read, construct and use simple to complex regular expressions. At the end of the session you'll understand how to define a regex that validates an e-mail address: \\b\\w[\\w.%+-]?@[\\w.-]+\\.[a-zA-Z]{2,6}\\b\nDownload the speaker slides and material",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "Java",
      "JavaScript",
      "perl",
      "Python",
      "Regular Expressions"
    ]
  },
  {
    "author": "Sunil Sabat",
    "author_desc": "I like code camp where I can experience many technologies in demo, speeches etc. I am Microsoft Certified Professional, CompTIA and IBM certified. I have MBA from Santa Clara. I have worked at Intel, IBM and other start-ups that went IPO or got acquired. I am always eager about NEXT FRONTIER in products/solutions that would change the world. Now, I work at Informatica Corp. My role is to work with my partners and help develop our  products with combined technologies for best user experience.",
    "title": "Securely developing and deploying multi cloud applications",
    "desc": "Today, enterprises and individual developers alike  want to develop applications that are multi cloud, secure and top at user experience. They want to deploy  secured applications rapidly with highest degree of code reuse and library uniformity. Web technologies change quickly and best practices are constantly evolving. How do you deploy applications securely across public cloud, private cloud and hybrid cloud? What steps you should take?\n\nIn this session, we will take a sample web application, and deploy to public cloud, hybrid cloud and private cloud securely. We will learn requirements, configurations needed at each step. While GitHub for SCM, HSM for crypto  key generation  and Kubernetes  orchestration are core components, you will know how setup and configuration are different for each cloud.  Cloud specific info  needs to be stored in a common repository and reused over time. A new  JSON standard is proposed to store meta data of each cloud. For multi cloud deployment, the merged JSON document becomes  key to drive the  development and deployment of applications to each cloud. Thanks to repository driven services, developer is constantly made aware of  each cloud requirements and restrictions as development progresses. It is powerful tool to help developers develop and deploy applications securely across  the cloud. \n\nIn the end, you will take away  few best practices to deploy your application securely across  all cloud environments.",
    "date_time": "9:15 AM Sunday",
    "tags": [
      "App Deployment",
      "Cloud",
      "Kubernetes",
      "Modular Architecture",
      "Programming Paradigms",
      "Security"
    ]
  },
  {
    "author": "Marek Sadowski",
    "author_desc": "Marek Sadowski is a full stack developer advocate, a robotics startup founder and an entrepreneur. He has about 20 year experience in consulting largest enterprises in USA, Europe, Middle East and Africa as a senior engineer and an IT architect in mobile, web, Java and integration technologies. As a graduate from the International Space University Marek pioneered in a research on VR goggles for the virtual reality system to control robots on Mars in NASA Ames. He founded a startup to deliver robotics solutions and services for space, military, and industrial sectors. Marek moved to Silicon Valley to promote IoT and robotics solutions driven in Swift, Node.js, Node.RED by mobile, AI and Cloud.",
    "title": "Serverless and Containers in the Cloud Age",
    "desc": "Using the container technology is one of the ways to deploy your application on the internet, the other options include using cloud native applications - PaaS, or alternatively by removing entire middleware overhead and using so called Serverless aka FaaS. \nDuring this talk you will learn what it takes to build an application with containers based on the open source Docker and Kubernetes. \nFurthermore you will be able to experience Serverless application. Finally you will get some introduction into a cloud application based on the Cloudfoundry Platform as a Service.\nDownload instructions to be prepared for this class\n\nDownload the speaker slides and material",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "Docker",
      "Kubernetes",
      "Paas",
      "serverless",
      "Watson"
    ]
  },
  {
    "author": "wesley chun",
    "author_desc": "+WESLEY CHUN, MSCS, is the author of Prentice Hall's bestselling \"Core Python\" book series & companion videos (corepython.com), co-author of \"Python Web Development with Django\" (withdjango.com), and has written for Linux Journal, CNET, and InformIT. In addition to being an engineer & Developer Advocate at Google, he runs CyberWeb (cyberwebconsulting.com), a consultancy specializing in Python training. Wesley has over 25 years of programming, teaching, and writing experience, including helping create Yahoo!Mail using Python almost 2 decades ago. He has taught numerous Python courses at Cisco, Disney, VMware, UC Santa Barbara, UC Santa Cruz, & Foothill College. Wesley holds degrees in CS, Math, and Music from the University of California, and loves traveling worldwide to meet developers, whether at a technical conference, user group meeting, or on a university campus. He is a Fellow of the Python Software Foundation and can be reached on Google+ or Twitter (@wescpy).",
    "title": "Serverless computing with Python and Google Cloud",
    "desc": "* BRING YOUR LAPTOPS FOR LIVE CODING! *Cloud computing has taken the industry by storm. Do you know EXACTLY what it is, and are you ready to part of the next generation workforce? What about cloud's 3 pillars, SaaS, PaaS, and IaaS? What does \"serverless\" mean? This session begins with a high-level overview of all of cloud, what is it, and why it's here. Next is an introduction to Google Cloud and what its myriad of products are, focusing on serverless solutions.The hands-on portion focuses on Google Cloud \"serverless\" solutions you can use with Python, including demos and live-coding (time-permitting). Come join us for this valuable session if you're a developer, business analyst, data scientist, technical manager, IT/admin staff, or hobbyist. If you live-code with us, chances are you'll leave with running code available to anyone around the world!TOPICS* Introduction to cloud computing* Introduction to Google Cloud* Hands-on coding with Google Cloud serverless solutions",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "API",
      "App Engine",
      "Cloud",
      "Cloud Functions",
      "Google",
      "Paas",
      "Python"
    ]
  },
  {
    "author": "Burr Sutter",
    "author_desc": "A lifelong developer advocate, community organizer, and technology evangelist, Burr Sutter is a featured speaker at technology events around the globe—from Bangalore to Brussels and Berlin to Beijing (and most parts in between)—he is currently Red Hat’s Director of Developer Experience. A Java Champion since 2005 and former president of the Atlanta Java User Group, Burr founded the DevNexus conference—now the second largest Java event in the U.S.—with the aim of making access to the world’s leading developers affordable to the developer community. When not speaking abroad, Burr is also the passionate creator and orchestrator of highly-interactive live demo keynotes at Red Hat Summit, the company’s premier annual event.",
    "title": "Serverless Java on Kubernetes",
    "desc": "Now that Kubernetes has become the defacto standard for Linux container orchestration and the next monolith and microservices application platform, the next battle is for Serverless architecture where Functions rule, there are numerous Open Source player competing for relevance in this space.  \n\nIn this session, we will be diving into OpenWhisk and Knative as two serverless solutions for the Kubernetes infrastructure.",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "knative",
      "Kubernetes",
      "serverless"
    ]
  },
  {
    "author": "Andrew Champagne",
    "author_desc": "Software Developer for Global Foundries in Vermont. Interests are in becoming a better programming. When I'm not writing code I'm skiing, hiking and watching Star Craft esports.",
    "title": "Software Development Process",
    "desc": "We'll have a discussion about software development. How to efficiently write software that gives you the best chance of success. How do you estimate how long it will take software projects to complete. How do you stop code creep and stay on task. How do you handle code review, testing and deployment processes that make sure that your clients are happy and never know how bad your code base is.  How to know when your process isn't working and when to change it.",
    "date_time": "9:15 AM Sunday",
    "tags": [
      "App Deployment",
      "application scalability",
      "Best Practices",
      "Clean Code"
    ]
  },
  {
    "author": "Stephen Boesch",
    "author_desc": "I am a developer focusing on scalable apps for data pipelines and machine learning on Hadoop and Spark infrastructures.  My background is in Java/Oracle/ETL from 1996 until 2011, at which point I started to focus on Hadoop, Spark and Scala. My work has been at a mix of the familiar large Internet/Systems company names and startups.",
    "title": "Statistics 102: Beyond the Mean, Median, and Variance",
    "desc": "This is a bit of whirlwind overview of some advanced beginner to intermediate level statistical topics . The first portion will focus on general topics and the second on specific statistical measures .Part 1: General topicsMoments eg. skew and kurtosisGoodness of fitIndependence and correlationsTouch on Design of ExperimentsProper representation across classesConfounding variablesSampling TechniquesData Quality issuesimputationNormalization (or not..)OutliersIf time: Touch on clustering vs regression vs classificationOccam's Razor / overfitting / model parsimonyPart 2: An Introduction to Statistical Measuresfor Clustering, Classification, and RegressionQualitatively: how do decide \"what is a good measure\"Typical choices of measures forClustering: Intra cluster similarity vs inter cluster distanceTypes of similarity and distance measuresDensity estimatesClassification:Mislabeling costsRegressionL2/L1/LassoR**2Comparison of distributionsKolmogorov-Smirnov KVL",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "Analytics",
      "Data Science",
      "Machine Learning",
      "math",
      "Statistics"
    ]
  },
  {
    "author": "Senthilkumar Gopal",
    "author_desc": "Senthilkumar Gopal works at eBay as an Identity Architect who leads and oversees Identity Infrastructure products consisting of Identity Linking Platform, OAuth Specification and Secure Token Storage/Authentication systems as part of the Identity platform. As the technology leader for these products, he helps determine direction and recommend strategy for Identity Platform as a whole and Identity Infrastructure in particular. He contributes to technology initiatives, architecture and influences implementation to garner measurable business improvements. He leads a focused and highly motivated scrum team of engineers with no dedicated testers or product owner. He is an engineer at heart who loves coding, refactoring and debugging crazy problems. Thrown into the foray of managing a team, he has built a strong group which delivers high quality products, but greatly motivated to push their limits. He has presented many technical talk for internal audiences and this will be his just his second talk as a rookie speaker in the external world.",
    "title": "10 steps to build a strong Token based API Security",
    "desc": "Many developers are well versed with domain based application development. However when it comes to security, there are very few who can ascertain to the credibility of their API and Identity assertion systems. This talk targets the uncertainty around the functioning and utility of tokens in an API security landscape. It addresses the basic needs of a token infrastructure and what would it take to build one. This talk aims to help developers embrace security and identity as part of their tool chain and remove the skepticism around building their own API security. The developers should be able to use this discussion as a launchpad for building their own API authentication systems. This is a unique talk as many companies closely guard the secret of how their token infrastructure functions.,Being the lead architect for eBay Identity and having hand crafted the infrastructure which powers eBay's entire API stack authentication, Senthilkumar is driving the vision for Identity architecture for the next generation of services and uniquely poised to help developers with the talk to understand the nuances of API security and token infrastructure. He will be providing references to OAuth RFC specifications, OWASP threats and how it is addressed etc.\nDownload the speaker slides and material",
    "date_time": "2:15 PM Sunday",
    "tags": [
      "API",
      "Architecture",
      "Best Practices",
      "microservices",
      "OAuth",
      "Security",
      "Web services"
    ]
  },
  {
    "author": "Ramnivas Laddad",
    "author_desc": "Ramnivas is a technologist, author, and presenter who is passionate about doing software right. He has been leading innovation in Spring Framework and Cloud Foundry since their beginning. Ramnivas has led a group in Cloud Foundry and started the Spring Cloud project. Ramnivas is the author of AspectJ in Action (1st ed, 2nd ed), the best-selling book on aspect-oriented programming that has been lauded by industry experts for its presentation of practical and innovative approach to solve real-world problems. He has at many leading industry events including JavaOne, ScalaDays, JavaPolis, No Fluff Just Stuff, SpringOne, and O'Reilly OSCON.",
    "title": "Succeeding with Full Stack Scala",
    "desc": "Unlike simple apps, where technology choices rarely matter, for complex apps, those choices can be crucial in getting the desired maintainability, agility, and performance.\n\nOur startup helps students learn Indian Classical Music with a modern approach by offering tools such as a composition editor, music transcriber, and real-time pitch/beat accuracy feedback provider right in the web browser.\n\nWe love Scala and use it for backend and frontend development. With some effort, we were able to keep the code simple, make development a joyful experience, and extract high performance. In this talk, share our experiences in choosing frontend frameworks, client-server communication, use of WebAssembly for performance critical portions, and so on.",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "App",
      "graphql",
      "JavaScript",
      "Scala",
      "scalajs"
    ]
  },
  {
    "author": "Oswald Campesato",
    "author_desc": "Oswald is passionate about education: a former PhD Candidate in Mathematics (ABD), with 4 Masters and 2 Bachelors degrees. Previously he worked in South America, Italy, and the French Riviera, and he traveled to 70 countries around the world. He has worked from C/C++/Java developer to CTO, and currently working at SwiftBot. He's comfortable in 4 languages and trying to learn Japanese. He's a Series Editor for Mercury Learning and working on his 17th book.",
    "title": "TensorFlow in your Browser",
    "desc": "This fast-paced session starts with an introduction to Neural Networks and Deep Learning (DL) concepts, followed by TensorFire (a JavaScript toolkit for TensorFlow), along with basic code samples in TensorFire. \nIf time permits, we'll also discuss state-of-the art developments in Keras, TensorFlow, and Deep Learning, followed by a book raffle for books published in 2018.",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "AI",
      "Deep Learning",
      "JavaScript",
      "Machine Learning"
    ]
  },
  {
    "author": "Abhinav Shroff",
    "author_desc": "Abhinav Shroff works as a Principal Product Manager at Oracle. He is a seasoned professional with wide experience in Middleware and Cloud technologies. He is responsible for evangelizing Oracle Developer Cloud Services with the developer community. His areas of expertise are DevOps, Java, and Mobility. He is an active speaker at technical conferences including Silicon Valley Code Camp, DevOpsDays, Java One, Oracle Open World, AIOUG, OTNYathra, Sangam, Oracle Code, GIDS to name a few and has delivered many technology workshops and sessions.\n\nhttps://www.youtube.com/watch?v=zkP1eeaQbU0&t=2320s",
    "title": "Terraform + Packer + Docker = Winning DevOps Team",
    "desc": "If you are serious about Cloud. Then you should be serious about DevOps. If you are now wondering where to start on DevOps. Then join this session to learn how you can script your infrastructure, from creating images, to provisioning compute instances on cloud, to containerizing your code using power packed tools like Terraform, Packer and Docker. See how you can reach the next level of infrastructure automation by using a DevOps platform on Cloud. Come and see how you can go from no infrastructure configured to application deployment in a matter of minutes.",
    "date_time": "9:15 AM Sunday",
    "tags": [
      "Agile",
      "DevOps",
      "Docker",
      "Terraform"
    ]
  },
  {
    "author": "Shaun Abram",
    "author_desc": "I'm a developer, technical lead and development manager, interested in software design, architecture and continuous deployment. I'm passionate about building quality software and like to write and speak about technology when I can.\n\nNorthern Ireland native now happily based in San Francisco.",
    "title": "Testing in Production",
    "desc": "The sole purpose of software is to have a positive impact on your customers.\nAnd the only place your software has an impact on your customers is production.\n\nWhile testing in demo and stage is good (indeed, essential), testing in production is all too often overlooked. Deploying to production and hoping for the best is a gamble, not a strategy.\n\nIn this talk, we discuss\n\n1) Better production deployment and testing strategies including dark pool testing, canary releases and feature switching.\n\n2) After deployment, your work is still not done. We'll talk about Observability, including monitoring, tracing and metrics.\n\n3) Finally, even with the best deployment strategies and monitoring techniques, your software WILL fail in production. It's a question of when, not if. So why not simulate those failures first? We'll finish with game days and chaos engineering. \n\nThis talk should be of interest to all developers, QA and Ops folks who are responsible for getting working software in front of users.\nDownload the speaker slides and material",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "DevOps",
      "Distributed Application",
      "microservices",
      "Testing",
      "Unit Testing"
    ]
  },
  {
    "author": "Jayson DeLancey",
    "author_desc": "Jayson DeLancey is a Senior Developer Evangelist / Advocate with HERE Technologies in Berkeley, CA where he focuses on the application of Location Technologies in software development.\n\nJayson has been a software engineer for the past 15+ years with development\nexperience at companies including DreamWorks Animation (Shrek, Kung Fu Panda, How to Train Your Dragon), Rackspace (OpenStack), General Electric (Python SDK), and The MathWorks (MATLAB).\n\nJayson often speaks on Industrial IoT and other technical topics at conferences such as Gluecon, O'Reilly Software Architecture, Intel Developer Forum, etc. He participated in the Digital Volcano project that won a Webby Award and was covered by CNET, Popular Mechanics, Living Science, and CNBC.",
    "title": "The Location of Things from A to (X,Y,Z)",
    "desc": "Increasingly there are three things that matter in the success of an application: location, location, location. Whether tracking the delivery of a package, the movement of a friend you are meeting, how to get to a place you want to see, the autonomous driving of a vehicle, or where to find our things – location is a critical contextual clue for making a valuable end-user experience.\n\nThis session will start with some location basics and then dive into trending technologies and best practices for using them in coding geospatial aware applications. A variety of open tools like GeoJSON and Tangram will be discussed.",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "Internet of Things",
      "IoT",
      "Location",
      "Maps",
      "Open Source"
    ]
  },
  {
    "author": "Marcus Blankenship",
    "author_desc": "I have hired, lead and coached cross-disciplinary design & development teams for over 15 years. Today I help other agency owners and technicians elevate from doing the hands on work to leading their teams.",
    "title": "The Science Behind Motivating Programmers",
    "desc": "What motivates programmers? Is it using new tech, solving hard problems, impactful work, or even... ping-pong tables? As too many managers have realized, a focus on simply “keeping developers happy” may not lead to increased motivation, performance or satisfaction.  Leader-Member Exchange Theory (LMX Theory), introduced in the 1980s, is a dyadic leadership theory grounded in decades of global studies with knowledge workers.  This talk introduces the basic concepts of LMX Theory, provides a practical leadership framework which tech leaders can use, and reveals new understandings about the workplace dynamics of highly motivated teams.",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "Happiness",
      "leadership",
      "management",
      "Team Management"
    ]
  },
  {
    "author": "Dave Nielsen",
    "author_desc": "As Head of Ecosystem Programs, Dave uses emerging technologies and open source projects like Microservices, Serverless & Kubernetes to bring the magic of Redis to the broader community. Dave has extensive ecosystem experience from his years of engagement in the web, cloud and big data trenches. Prior to Redis Labs, Dave led the relationship between Intel’s Deep Learning in Apache Spark project and public cloud providers; and at PayPal where he helped pioneer web api developer evangelism.",
    "title": "Top 10 Microservices with Redis",
    "desc": "Most Microservices need a database. With SQL and Redis you have most of what you need. In this talk we'll share database tips and tricks using SQL & Redis for creating scalable Microservices. Examples include: user registration, session management, online presence, custom analytics, keyword search, product recommendations, product catalog, order management, and error message leaderboard. Demos will be made available via NodeJS & Spring Boot, and via general Redis command-line text.",
    "date_time": "5:00 PM Saturday",
    "tags": [
      "Development",
      "Java",
      "JavaScript",
      "Kubernetes",
      "microservices",
      "NodeJS",
      "Redis"
    ]
  },
  {
    "author": "Fernando Wong",
    "author_desc": "Fernando Wong has 20 years of experience bridging brick-and-mortar business with cutting edge technology.\nGrowing up in South America in the 80s, Fernando has first-hand experience on the ups and downs of businesses.\nThen in the 90s in San Francisco, Fernando has further seen the ups and downs of technology.\nPowered with a computer science degree from UC Berkeley and the experience of business processes, Fernando has spent the last two decades developing and fine tuning technology to serve mom-and-pop shops to fortune 500 companies.",
    "title": "Turn-key development with Oracle Application Express",
    "desc": "Oracle is a household name in database.  But did you know there Oracle offers a powerful IDE tool called Application Express?  Also called Apex in short.  \nThis is one of the most powerful web development tool that can create turn-key data driven website in minutes.  Yes, literally in minutes.\nWith the availability of free Oracle Database Express, this is the perfect tool for beginner to advanced developers.",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "Database",
      "Oracle",
      "SQL",
      "Web"
    ]
  },
  {
    "author": "Bryan Hughes",
    "author_desc": "Bryan Hughes is a technical evangelist at Microsoft, long-time member of the Node.js and NodeBots communities, and tech activist. Bryan is the creator of Raspi IO which provides Raspberry Pi support for the Johnny-Five JavaScript robotics library. Bryan also created Raver Lights, a distributed wireless lighting system designed for festivals, and Request Inspector, a Node.js performance diagnostics tool. Outside of tech, Bryan is an amateur photographer, occasional writer, a once upon a time pianist, and a wine aficionado.",
    "title": "TypeScript in Practice",
    "desc": "Are you interested in TypeScript, but not sure where to start? Like most modern web development, it can feel like there are too many options and no obvious answers.\n\nThis talk will share best practices for integrating TypeScript into both Node.js and Webpack+React/JSX workflows, how you can benefit from the features TypeScript offers, and answer common questions about TypeScript.",
    "date_time": "11:00 AM Saturday",
    "tags": [
      "Browsers",
      "JavaScript",
      "JavaScript",
      "NodeJS",
      "TypeScript"
    ]
  },
  {
    "author": "Bryan Hughes",
    "author_desc": "Bryan Hughes is a technical evangelist at Microsoft, long-time member of the Node.js and NodeBots communities, and tech activist. Bryan is the creator of Raspi IO which provides Raspberry Pi support for the Johnny-Five JavaScript robotics library. Bryan also created Raver Lights, a distributed wireless lighting system designed for festivals, and Request Inspector, a Node.js performance diagnostics tool. Outside of tech, Bryan is an amateur photographer, occasional writer, a once upon a time pianist, and a wine aficionado.",
    "title": "Understanding Functions and \"this\" in the World of ES2018",
    "desc": "The \"this\" keyword has long been a source of confusion, and new features added to JavaScript in recent years have muddled the picture even more.\n\nThis talk will walk you through the details of how \"this\" works in the context of modern JavaScript. We'll cover the differences between function declarations, function expressions, arrow functions, object-shorthand function notation, and class fields, as well as best practices when integrating with other ES2015+ goodies.",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "Asynchronous Programming",
      "Browsers",
      "ES6",
      "JavaScript",
      "JavaScript",
      "functional programming"
    ]
  },
  {
    "author": "Andrew Brogdon",
    "author_desc": "As an engineer on the Flutter developer relations team, Andrew is responsible for making it easy to get started and grow. If you've read articles about Flutter, downloaded sample code, or seen YouTube videos about how to put Flutter to work, chances are you've seen his stuff.",
    "title": "Under the Hood with Flutter",
    "desc": "For many developers, getting started with Flutter means getting used to widgets: how to use a Text widget, for example, and how to define new widgets and compose a complete user interface. An important step in the progression from beginner to seasoned coder is gaining an understanding of what lies under the hood, beneath the widget layer. In this talk, you'll learn what Elements, State objects, and RenderObjects are, how Flutter's layered architecture separates composition, layout, and rendering, and some best practices for keeping you apps running at 60 FPS.",
    "date_time": "2:15 PM Sunday",
    "tags": [
      "Android",
      "dart",
      "iOS",
      "Mobile",
      "reactive"
    ]
  },
  {
    "author": "Alejandra Quetzalli",
    "author_desc": "I'm Alejandra, founder of sheCodesNow.com. sheCodesNow empowers women who thought it was too late in their lives to join a bootcamp, moms who’ve been out of the work field, and women who thought they were “too shy” to do public speaking. We’ve encouraged, trained, and helped women become successful.",
    "title": "5 Ways sheCodesNow is changing Women’s Lives",
    "desc": "Worldwide, there is a lack of free programming workshops with in-person mentoring for women who dream of joining Tech. In an effort to help rectify this problem for women in Seattle, sheCodesNow was born. sheCodesNow empowers women who thought it was too late in their lives to join a bootcamp, moms who’ve been out of the work field, and women who thought they were “too shy” to do public speaking. We’ve encouraged, trained, and helped women become successful. \n\nIn this session, you will learn 5 ways that this organization is changing women’s lives and how you can join their effort for mentoring future #WomenInTech. \nDownload the speaker slides and material",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "Accessibility",
      "Career",
      "Coaching",
      "Collaboration",
      "Community"
    ]
  },
  {
    "author": "Douglas Crockford",
    "author_desc": "Douglas Crockford discovered the JSON Data Interchange Format. He is also the author of _JavaScript: The Good Parts_. He has been called a guru, but he is actually more of a mahatma.",
    "title": "Web Panel with Douglas Crockford, Steve Souders and Mike North",
    "desc": "Join this star filled panel, Douglas Crockford, Steve Souders and Mike North talk about the web. A better set of luminaries you will not find.  Both Douglas Crockford and Steve Souders keynote the largest tech conferences in the world regularly, and Mike North a well known tech author who also leads developer training at LinkedIn.\n\nKevin Nilson will moderate this much anticipated lively session right after lunch on Saturday on the main stage of Code Camp. Don't miss it!",
    "date_time": "1:00 PM Saturday",
    "tags": [
      "JavaScript",
      "Panel",
      "Web",
      "Web Performance"
    ]
  },
  {
    "author": "Sidharth Rajaram",
    "author_desc": "Sidharth is a high school senior with a strong interest in math and programming. As a big basketball junkie, he spends a lot of his time developing tools that perform analysis on NBA statistics. He also has some experience in iOS development, autonomous robots, natural language processing, and machine learning. Sid has worked with teams at the Stanford Artificial Intelligence Lab as well as having done private contracting. Check out @sidharthrajaram on GitHub to take a look at some of his current and past projects.",
    "title": "Web Scraping with Python",
    "desc": "Sometimes the data you want is stuck on a website, in the form of a table or paragraph. Whether it is for your machine learning project or just viewing site text, web scraping is an important skill to have. Using BeautifulSoup, we can create a simple Python web scraper that can be used to retrieve sports statistics or stock prices. We will begin with a preface about BeautifulSoup, Pandas, and other helpful libraries. Following that we’ll work through the implementation of some scrapers and then have a discussion about how to move forward with scraped data. This presentation should clear up doubts and hopefully spark new ideas in your heads.\nDownload the speaker slides and material",
    "date_time": "10:45 AM Sunday",
    "tags": [
      "data",
      "Data Mining",
      "Data Structures",
      "Python",
      "Statistics",
      "Web"
    ]
  },
  {
    "author": "Vidal Graupera",
    "author_desc": "Vidal Graupera is an experienced engineering leader. He hosts the popular \"Managers Club\" website where you will find interviews with top engineering leaders and managers at https://www.managersclub.com.  Vidal works as an Engineering Manager at Uber.\n\nVidal holds engineering degrees from Carnegie Mellon University and the University of Southern CA. He also holds an MBA from Santa Clara University. Vidal is a co-author of \"Pro Smartphone Cross-Platform Development: iPhone, Blackberry, Windows Mobile and Android Development and Distribution\" from Apress.",
    "title": "What I Learned from Interviewing 50 Engineering Managers",
    "desc": "Whether you’re taking your first steps in Engineering Management or looking to up your game with valuable knowledge, in this talk you will learn a rich collection of tips and tricks from real-life engineering leaders. Not everyone has good mentors. In the past 9 months, I have interviewed over 50 engineering managers and leaders for https://www.managersclub.com. I've asked them a lot of the same questions so we can cover different answers and learn various approaches.",
    "date_time": "3:45 PM Saturday",
    "tags": [
      "management"
    ]
  },
  {
    "author": "Aaron Sahagun",
    "author_desc": "I am the group manager/section manager for the Technical Program Management Office (TPMO) Section/Group at Kyocera in the SF East Bay. Agile Certified Practitioner (PMI-ACP), Certified Scrum Master (CSM) & Certified Professional Scrum Master (PSM).\n\nPrior to Kyocera & TubeMogul, Aaron founded Alumwire, Inc. where he project managed the development of Alumwire's proprietary video chat software during the early days of the Company in Berkeley, CA. He drove the Company’s strategic direction, business development and marketing activities as its CEO. Aaron was named by BusinessWeek as one of “The Top 25 Young Entrepreneurs”. Aaron was also featured on NBC, CBS and CNET. The initial sales of $100K+ from Alumwire’s Fortune 500 beta clients led to a $1.4 million dollar financing round. Aaron successfully exited Alumwire in 2011 (acquired by TalentCircles, Inc. in August, 2011).\n\nAaron earned his Bachelor of Science in Business Administration from The Walter A. Haas School of Business at the University of California, Berkeley. Prior to attending UC Berkeley, Aaron attended a private, technical high school in Los Angeles where he majored in computer science and developed games in Visual C++, C++, Visual Basic and Javascript. He programmed e-commerce web sites for several companies in the L.A. area during his teenage years.",
    "title": "Which Agile Framework Will Increase the ROI of My Company?",
    "desc": "Measuring the ROI of agile methods is one of the most important factors in figuring out what agile framework to adopt. Scope is variable in agile projects and so we are able to prioritize based on business value. As a result, it is very much possible to have a faster return on investment in agile projects compared to traditional projects. We can even increase the ROI more by adopting the right agile framework given a team's skillset (such as adopting the XP Agile Framework for the CI/CD practice).\n\nWe will explore several agile frameworks (such as Scrum, XP, Lean, FDD, etc.) and recommend which of these agile frameworks increases the ROI for specific types of Companies. We will look at different technologies including GitLab, OnBase, Jira, and Confluence.\n\nThis session is for current and prospective engineering directors/managers, technical program managers, and technical product managers. Managers that are involved with managing software engineers in software Companies are expected to benefit the most.",
    "date_time": "12:45 PM Sunday",
    "tags": [
      "Agile",
      "Agile Manifesto",
      "management",
      "management styles",
      "Process",
      "Product Management",
      "Project Management"
    ]
  },
  {
    "author": "Mickey W. Mantle",
    "author_desc": "Mickey has been developing software systems and products for over 40 years, as a systems programmer, Tech Lead, Manager, VP Engineering, CTO, COO, and now CEO/CTO of his own company.  During this time he has contributed to several notable companies, including computer graphics pioneer Evans & Sutherland (E&S), Pixar, Broderbund Software, and Gracenote – always in a technical leadership role.\n\nHe continues developing software at Wanderful (see wanderfulstorybooks.com), developing and publishing Apps for iOS, Android, macOS, and Windows.\n\nWorking with co-author Ron Lichty, they wrote the book “Managing the Unmanageable: Rules, Tools, and Insights for Managing Software People and Teams”. Published by Addison Wesley, this book distills their experience of over 70 combined years developing software and managing programmers and has received many accolades including being favorably compared to The Mythical Man Month and Peopleware (see managingtheunmanageable.net).",
    "title": "You Don’t Know What You Don’t Know! Insights for Technical Leaders",
    "desc": "Technical leaders today can easily be overwhelmed by the tasks they must perform and the rapidly changing technology they must wrestle with daily.  Understanding the stages most companies go through as they grow, and the key decisions that must be made at the stage transitions, can help leaders cope more effectively in their roles.  \n\nThis talk will present these stages of growth and outline key decisions that must be made as a company transitions from being a startup, to small, to mid-sized, and beyond.\n\nThis session will be of interest to technical leaders at all levels, from Lead Tech to CTO, who want to gain insight into how to better anticipate changes that will occur as their company matures and grows.",
    "date_time": "2:15 PM Saturday",
    "tags": [
      "Business Growth",
      "Career",
      "Engineering Process",
      "Enterprise maturity",
      "Hiring",
      "management",
      "team building"
    ]
  }
]